PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: Cy_I3C_Init
****************************************************************************//**
*
* Initializes the I3C block.
*
* \param base
* The pointer to the I3C instance.
*
* \param config
* The pointer to the configuration structure \ref cy_stc_i3c_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
* \note
* For I3C target operations pin mux IO lines to GPIO before calling this API using \ref Cy_GPIO_SetHSIOM,
* and then pin mux IO lines to I3C functionality after this API call.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_Init(I3C_CORE_Type *base, cy_stc_i3c_config_t const *config, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == config) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    CY_ASSERT_L3(CY_I3C_IS_MODE_VALID(config->i3cMode));
    if (CY_I3C_CONTROLLER == config->i3cMode || CY_I3C_SECONDARY_CONTROLLER == config->deviceRoleCap)
    {
        CY_ASSERT_L3(CY_I3C_IS_BUS_MODE_VALID(config->i3cBusMode));
        CY_ASSERT_L2(CY_IS_I3C_SDA_HOLD_TIME_VALID(config->sdaHoldTime));
        CY_ASSERT_L2(CY_IS_I3C_QUEUE_THLD_VALID(config->ibiQueueThld));
    }
    if (CY_I3C_TARGET == config->i3cMode || CY_I3C_SECONDARY_CONTROLLER == config->deviceRoleCap)
    {
        CY_ASSERT_L2(CY_IS_I3C_STATIC_ADDRESS_VALID(config->staticAddress));
        CY_ASSERT_L2(CY_IS_I3C_PID_VALID(config->pid));
        CY_ASSERT_L3(CY_IS_I3C_DEVICE_ROLE_CAP_VALID(config->deviceRoleCap));
        CY_ASSERT_L2(CY_IS_I3C_BUS_IDLE_TIME_VALID(config->busIdleTime));
    }
    if (CY_I3C_CONTROLLER == config->i3cMode)
    {
        CY_ASSERT_L2(CY_IS_I3C_ADDR_NOT_RESERVED(config->dynamicAddr));
    }
    CY_ASSERT_L3(CY_I3C_IS_BUFFER_DEPTH_VALID(config->txEmptyBufThld));
    CY_ASSERT_L3(CY_I3C_IS_BUFFER_DEPTH_VALID(config->rxBufThld));
    CY_ASSERT_L3(CY_I3C_IS_BUFFER_DEPTH_VALID(config->txBufStartThld));
    CY_ASSERT_L3(CY_I3C_IS_BUFFER_DEPTH_VALID(config->rxBufStartThld));

    CY_ASSERT_L2(CY_IS_I3C_QUEUE_THLD_VALID(config->cmdQueueEmptyThld));
    CY_ASSERT_L2(CY_IS_I3C_QUEUE_THLD_VALID(config->respQueueThld));

    /* Initialize the context */
    context->i3cBusMode = config->i3cBusMode;
    context->i3cClockHz = config->i3cClockHz;
    context->openDrainSclRate = config->openDrainSclRate;
    context->state = CY_I3C_IDLE;
    context->Enabled = false;

    /* Controller specific */
    context->controllerBuffer = NULL;
    context->controllerStatus = 0UL;
    context->controllerBufferIdx = 0UL;
    context->controllerBufferSize = 0UL;
    context->destDeviceAddr = 0U;
    context->hdrCmd = NULL;
    (void)memset(context->devList, 0, CY_I3C_MAX_DEVS * sizeof(cy_stc_i3c_controller_devlist_t));

    /*Target specific */
    context->targetStatus = 0UL;

    context->targetRxBuffer = NULL;
    context->targetRxBufferIdx = 0UL;
    context->targetRxBufferSize = 0UL;
    context->targetRxBufferCnt = 0UL;

    context->targetTxBuffer = NULL;
    context->targetTxBufferIdx = 0UL;
    context->targetTxBufferSize = 0UL;
    context->targetTxBufferCnt = 0UL;

    /* Unregister callbacks */
    context->cbEvents = NULL;
    context->cbIbi = NULL;

    /* Enabling the IP */
    I3C->CTRL = I3C_CTRL_ENABLED_Msk;

    if (CY_I3C_CONTROLLER == config->i3cMode)
    {
        cy_stc_i3c_controller_t *i3cController = &(context->i3cController);

        i3cController->freePos = 0x7FFUL;
        i3cController->lastAddress = 0U;
        i3cController->devCount = 0UL;
        i3cController->i2cDeviceCount = 0UL;
        i3cController->dynAddrDevCount = 0UL;

        /* Prepare the address slot status array */
        InitAddrslots(context);

        /* Setting the device operation mode to Controller - 0U */
        I3C_CORE_DEVICE_CTRL_EXTENDED(base) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_CONTROLLER);

        if (!config->manualDataRate)
        {
            (void)Cy_I3C_SetDataRate(base, config->i3cSclRate, config->i3cClockHz, context);
        }
        else
        {
            I3C_CORE_SCL_I3C_OD_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_HCNT, config->openDrainHighCnt) |
                                               _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_LCNT, config->openDrainLowCnt);
            I3C_CORE_SCL_I3C_PP_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_HCNT, config->pushPullHighCnt) |
                                               _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_LCNT, config->pushPullLowCnt);
            I3C_CORE_SCL_I2C_FM_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_HCNT, config->i2cFMHighCnt) |
                                               _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_LCNT, config->i2cFMLowCnt);
            I3C_CORE_SCL_I2C_FMP_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_HCNT, config->i2cFMPlusHighCnt) |
                                                _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_LCNT, config->i2cFMPlusLowCnt);
            I3C_CORE_SCL_EXT_LCNT_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_1, config->extLowCnt1) |
                                                 _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_2, config->extLowCnt2) |
                                                 _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_3, config->extLowCnt3) |
                                                 _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_4, config->extLowCnt4);
            I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING_I3C_EXT_TERMN_LCNT, config->extTerminationLowCnt);
        }

        I3C_CORE_DEVICE_CTRL(base) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_IBA_INCLUDE, config->ibaInclude ? 1UL : 0UL) |
                                     _VAL2FLD(I3C_CORE_DEVICE_CTRL_HOT_JOIN_CTRL, config->hotJoinCtrl ? 1UL : 0UL);

