PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
        I3C_CORE_DEVICE_ADDR(base) = _VAL2FLD(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, config->dynamicAddr) |
                                     I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID_Msk;

        SetAddrslotStatus(config->dynamicAddr, CY_I3C_ADDR_SLOT_I3C_DEV, context);

        I3C_CORE_BUS_FREE_AVAIL_TIMING(base) |= _VAL2FLD(I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_FREE_TIME, config->busFreeTime);

        I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING(base) = _VAL2FLD(I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_TX_HOLD, config->sdaHoldTime);

        I3C_CORE_QUEUE_THLD_CTRL(base) = _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD, config->cmdQueueEmptyThld) |
                                         _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, config->respQueueThld) |
                                         _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD, config->ibiQueueThld);

#if CY_IP_MXI3C_VERSION_MINOR == 1u
        CY_ASSERT_L2(CY_IS_I3C_IBI_DATA_THLD_VALID(config->ibiDataThld));
        I3C_CORE_QUEUE_THLD_CTRL(base) |= _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_DATA_THLD, config->ibiDataThld);
#endif

        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

        context->i3cMode = config->i3cMode;

    }

    else
    {
#if CY_IP_MXI3C_VERSION_MINOR == 1u
        /* Setting the device operation mode to Target - 1U */
        I3C_CORE_DEVICE_CTRL_EXTENDED(base) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_TARGET);

        /* On setting this ADAPTIVE_I2C_I3C bit, the controller generates hot-join request only when it is in/changes to I3C mode of operation. */
        I3C_CORE_DEVICE_CTRL(base) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_ADAPTIVE_I2C_I3C, config->adaptiveI2CI3C ? 1UL : 0UL);

        if (0U != config->staticAddress)
        {
            I3C_CORE_DEVICE_ADDR(base) |= _VAL2FLD(I3C_CORE_DEVICE_ADDR_STATIC_ADDR, config->staticAddress) |
                                          I3C_CORE_DEVICE_ADDR_STATIC_ADDR_VALID_Msk;
        }

        /*
            1. Configure the TGT_CHAR_CTRL register
            2. Configure the two PID registers
        */

        I3C_CORE_TGT_PID_VALUE(base) = (uint32_t)config->pid;

        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Intentional typecast from "unsigned 64-bit int" to narrower essential type "unsigned 32-bit int"');
        I3C_CORE_TGT_MIPI_ID_VALUE(base) = (config->pid) >> 32UL;

        I3C_CORE_TGT_CHAR_CTRL(base) |= _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_MAX_DATA_SPEED_LIMIT, config->speedLimit) |
                                        _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_HDR_CAPABLE, config->hdrCapable) |
                                        _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_DCR, config->dcr) |
                                        _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_DEVICE_ROLE, config->deviceRoleCap);

        /* Note:
            1. If this bit is set, the controller is allowed to send hot-join request intr on the bus. This bit, if set, can be set or cleared by the I3C controller
               via ENEC or DISEC CCCs.
            2. If this bit is set to 0, the controller will not be allowed to send hot-join request intr on the bus. The CCCs will not have any effects on this field.
        */
        I3C_CORE_TGT_EVENT_STATUS(base) &= (config->hotjoinEnable) ? I3C_CORE_TGT_EVENT_STATUS_HJ_EN_Msk : (~I3C_CORE_TGT_EVENT_STATUS_HJ_EN_Msk);

        I3C_CORE_BUS_FREE_AVAIL_TIMING(base) |=  _VAL2FLD(I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_AVAILABLE_TIME, config->busAvailTime);

        I3C_CORE_BUS_IDLE_TIMING(base) = _VAL2FLD(I3C_CORE_BUS_IDLE_TIMING_BUS_IDLE_TIME, config->busIdleTime);


        I3C_CORE_QUEUE_THLD_CTRL(base) = _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD, config->cmdQueueEmptyThld) |
                                         _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, config->respQueueThld);

        if (CY_I3C_SECONDARY_CONTROLLER == config->deviceRoleCap) /* secondary Controller Mode */
        {
            Cy_I3C_SetInterruptMask(base, CY_I3C_TGT_INTR_Msk | CY_I3C_INTR_DEFTGT_STS);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_TGT_INTR_Msk | CY_I3C_INTR_DEFTGT_STS);
            context->i3cMode = CY_I3C_SECONDARY_CONTROLLER;
        }
        else
        {
            Cy_I3C_SetInterruptMask(base, CY_I3C_TGT_INTR_Msk);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_TGT_INTR_Msk);
            context->i3cMode = config->i3cMode;
        }

        context->resetMode = CY_I3C_PERIPHERAL_RESET;
        context->i3cSclRate = config->i3cSclRate;
#endif
    }

    I3C_CORE_DATA_BUFFER_THLD_CTRL(base) = _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, config->rxBufThld) |
                                           _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD, config->txEmptyBufThld) |
                                           _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_START_THLD, config->rxBufStartThld) |
                                           _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_START_THLD, config->txBufStartThld);

    /* Config for DS wakeup restore */
    (void)memcpy(&(context->dsConfig), config, sizeof(cy_stc_i3c_config_t));
    context->intr_mask = 0UL;

    return CY_I3C_SUCCESS;

}


/*******************************************************************************
*  Function Name: Cy_I3C_Deinit
****************************************************************************//**
*
* Deinitializes the I3C block.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_DeInit(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);

