PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    uint8_t index;
    context->Enabled = false;
    if (_FLD2VAL(I3C_CTRL_ENABLED, I3C->CTRL) == 1U)
    {
        Cy_I3C_Disable(base, context);
        if (CY_I3C_TARGET != context->i3cMode)
        {
            /* Set the address slot statuses to free */
            DeInitAddrslots(context);

            for (index = 0U; (index < CY_I3C_MAX_DEVS); index++)
            {
                /* Clears the DAT entries */
                Cy_I3C_WriteIntoDeviceAddressTable(base, index, 0UL);
            }
        }
        I3C_CORE_QUEUE_THLD_CTRL(base) = I3C_CORE_QUEUE_THLD_CTRL_DEF_VAL;
        I3C_CORE_DATA_BUFFER_THLD_CTRL(base) = I3C_CORE_DATA_BUFFER_THLD_CTRL_DEF_VAL;

        I3C_CORE_INTR_STATUS_EN(base) = 0UL;
        I3C_CORE_INTR_SIGNAL_EN(base) = 0UL;
    }

}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerAttachI2CDevice
****************************************************************************//**
*
* Attaches an I2C device to the bus as defined by \ref cy_stc_i2c_device_t.
* It is required to provide device static address and lvr information
* in \ref cy_stc_i2c_device_t.
*
* \param base
* The pointer to the I3C instance.
*
* \param i2cDevice
* The pointer to the I2C device description structure \ref cy_stc_i2c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerAttachI2CDevice(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDevice, cy_stc_i3c_context_t *context)
{

    if ((NULL == base) || (NULL == i2cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    uint32_t value;
    uint8_t lvr, pos;

    /* Cannot add if there are already 11 devices on the bus */
    if (CY_I3C_MAX_DEVS <= (i3cController->devCount))
    {
        return CY_I3C_CONTROLLER_MAX_DEVS_PRESENT;
    }

    /* LVR: Legacy Virtual Register
    bit[7-5]: 000 - Legacy I2C only with 50ns IO Spike Filter
              001 and 010 - Legacy I2C only without 50ns IO Spike Filter
              others - reserved */
    lvr = i2cDevice->lvr;

    if (CY_I3C_ADDR_SLOT_FREE != GetAaddrslotStatus(i2cDevice->staticAddress, context))
    {
        return CY_I3C_CONTROLLER_FREE_ADDR_UNAVIAL;
    }
    /* BROS mentions not to support devices that lack the 50ns spike filters */
    if (0U != (CY_I3C_LVR_LEGACY_I2C_INDEX_MASK & lvr))
    {
        return CY_I3C_CONTROLLER_BAD_I2C_DEVICE;
    }

    SetAddrslotStatus(i2cDevice->staticAddress, CY_I3C_ADDR_SLOT_I2C_DEV, context);

    /* Populate the device address table with the static address of the device */
    value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, i2cDevice->staticAddress) |
            I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Msk;

    pos = (uint8_t)(GetDATFreePos(base, context));

    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

    /* Maintaining a local list of i2c devices */
    Cy_I3C_UpdateI2CDevInList(i2cDevice, pos, context);

    /* Update the free position index of the device address table */
    (i3cController->freePos) = ~(CY_I3C_BIT(pos));
    (i3cController->devCount)++;
    (i3cController->i2cDeviceCount)++;

    I3C_CORE_DEVICE_CTRL(base) |= I3C_CORE_DEVICE_CTRL_I2C_TARGET_PRESENT_Msk;

    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerDetachI2CDevice
****************************************************************************//**
*
* Detaches an I2C device from the bus defined by \ref cy_stc_i2c_device_t.
*
* \param base
* The pointer to the I3C instance.
*
* \param i2cDevice
* pointer to the I2C device description structure \ref cy_stc_i2c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerDetachI2CDevice(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDevice, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == i2cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    uint32_t devIndex;

    /* "devIndex" - Position of the device in the DAT which has to be detached */
    devIndex = GetI2CDevAddrPos(base, i2cDevice->staticAddress, context);
    if (((uint32_t)CY_I3C_BAD_PARAM) == devIndex)
    {
        return CY_I3C_BAD_PARAM;
    }

    RearrangeAddrTable(base, (uint8_t)devIndex, context);

    context->i3cController.devCount--;
    context->i3cController.i2cDeviceCount--;
    SetAddrslotStatus((i2cDevice->staticAddress), CY_I3C_ADDR_SLOT_FREE, context);

    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerAttachI3CDevice
****************************************************************************//**
*
* Attaches an I3C device to the bus defined by \ref cy_stc_i3c_device_t.
*
* \param base
* The pointer to the I3C instance.
*
* \param i3cDevice
* The pointer to the i3c device description structure \ref cy_stc_i3c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
* \note
* This function is used to attach I3C devices with Static Addresses only.
*
*******************************************************************************/
/* This is blocking function, where we wait for the response packet,
   assuming the controller treats no response as NACK after waiting for a decent amount of time */
cy_en_i3c_status_t Cy_I3C_ControllerAttachI3CDevice(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == i3cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    uint8_t dynamicAddress = 0U;
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    cy_stc_i3c_ccc_cmd_t cmd;
    cy_stc_i3c_ccc_setda_t i3cCccSetda;
    cy_stc_i3c_ccc_payload_t payload;

    /* Cannot add if there are already 11 devices on the bus */
    if (CY_I3C_MAX_DEVS <= (i3cController->devCount))
    {
        return CY_I3C_CONTROLLER_MAX_DEVS_PRESENT;
    }

