PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    if (0U != i3cDevice->dynamicAddress)
    {
        /* The I3C device has an expected dynamic address */

        /* check if the expected dynamic address is available to be assigned */
        /* If not available, return */

        if (CY_I3C_ADDR_SLOT_FREE != GetAaddrslotStatus(i3cDevice->dynamicAddress, context))
        {
            return CY_I3C_CONTROLLER_FREE_ADDR_UNAVIAL;
        }

        dynamicAddress = i3cDevice->dynamicAddress;
    }

    else
    {
        /* If the Target device doesn't have an expected dynamic address, pick a free address from the list */
        retStatus = Cy_I3C_ControllerGetFreeDeviceAddress(base, &dynamicAddress, context);
        if (CY_I3C_CONTROLLER_FREE_ADDR_UNAVIAL == retStatus)
        {
            return retStatus;
        }

        i3cController->lastAddress = dynamicAddress;
    }

    /* Send SETDASA CCC command */
    i3cCccSetda.address = dynamicAddress;
    cmd.data = &payload;
    cmd.data->data = &(i3cCccSetda.address);
    cmd.data->len = (uint16_t)(sizeof(i3cCccSetda));
    cmd.cmd = (uint8_t)CY_I3C_CCC_SETDASA;
    cmd.address = i3cDevice->staticAddress;
    retStatus = Cy_I3C_SetDASA(base, &cmd, context);

    return retStatus;

}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerDetachI3CDevice
****************************************************************************//**
*
* Detaches an I3C device from the bus defined by \ref cy_stc_i3c_device_t.
*
* \param base
* The pointer to the I3C instance.
*
* \param i3cDevice
* The pointer to the I3C device description structure \ref cy_stc_i3c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerDetachI3CDevice(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == i3cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    uint32_t devIndex ;
    cy_en_i3c_status_t retstatus;
    cy_stc_i3c_ccc_cmd_t cccCmd = {0};
    cy_stc_i3c_ccc_payload_t payload;

    devIndex = GetI3CDevAddrPos(base, i3cDevice->dynamicAddress, context);
    if (((uint32_t)CY_I3C_BAD_PARAM) == devIndex)
    {
        return CY_I3C_BAD_PARAM;
    }

    cccCmd.address = i3cDevice->dynamicAddress;
    cccCmd.cmd = (uint8_t)(CY_I3C_CCC_RSTDAA(false));
    cccCmd.data = &payload;
    cccCmd.data->data = NULL;
    cccCmd.data->len = 0U;

    retstatus = rstdaa_ccc(base, &cccCmd, context);
    if (CY_I3C_SUCCESS != retstatus)
    {
        return retstatus;
    }

    RearrangeAddrTable(base, (uint8_t)devIndex, context);

    context->i3cController.devCount--;
    SetAddrslotStatus((i3cDevice->dynamicAddress), CY_I3C_ADDR_SLOT_FREE, context);

    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_Enable
****************************************************************************//**
* Enables the I3C block.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_Enable(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    uint32_t interruptState;
    I3C_CORE_DEVICE_CTRL(base) |= _VAL2FLD(I3C_CORE_DEVICE_CTRL_ENABLE, 1);

#if CY_IP_MXI3C_VERSION_MINOR == 0u
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;
    cy_en_i3c_status_t retStatus;
    do
    {
        /* wait till the enable is completed */
        retStatus = I3C_Check_Timeout(&timeout);
    }
    while (retStatus == CY_I3C_SUCCESS && (_FLD2VAL(I3C_CORE_DEVICE_CTRL_ENABLE, I3C_CORE_DEVICE_CTRL(base))) != 1U);
#else
    if (I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_TARGET == _FLD2VAL(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, I3C_CORE_DEVICE_CTRL_EXTENDED(base)))
    {
        base->EXT_TX_DATA_PORT_2 = _VAL2FLD(I3C_CORE_EXT_TX_DATA_PORT_2_EXT_TX_DATA_PORT_2, 0x80U);
        base->EXT_TX_DATA_PORT_3 = _VAL2FLD(I3C_CORE_EXT_TX_DATA_PORT_3_EXT_TX_DATA_PORT_3, 0x80U);
        base->EXT_CMD_REG_2 |= _VAL2FLD(I3C_CORE_EXT_CMD_REG_3_DL_LSB, 1U) | _VAL2FLD(I3C_CORE_EXT_CMD_REG_3_DEFINING_BYTE, 0U) | _VAL2FLD(I3C_CORE_EXT_CMD_REG_3_CCC_TYPE, CY_I3C_CCC_RSTACT(false));
        base->EXT_CMD_REG_3 |= _VAL2FLD(I3C_CORE_EXT_CMD_REG_3_DL_LSB, 1U) | _VAL2FLD(I3C_CORE_EXT_CMD_REG_3_DEFINING_BYTE, 1U) | _VAL2FLD(I3C_CORE_EXT_CMD_REG_3_CCC_TYPE, CY_I3C_CCC_RSTACT(false));
    }
#endif

    interruptState = Cy_SysLib_EnterCriticalSection();
    context->Enabled = true;
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
*  Function Name: Cy_I3C_Disable
****************************************************************************//**
* Disables the I3C block.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* The I3C controller will complete any pending bus transaction before it gets
* disabled.
*******************************************************************************/
void Cy_I3C_Disable(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;
    uint32_t interruptState;
    cy_en_i3c_status_t retStatus;

    I3C_CORE_DEVICE_CTRL(base) &= ~I3C_CORE_DEVICE_CTRL_ENABLE_Msk;

