PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    interruptState = Cy_SysLib_EnterCriticalSection();
    context->Enabled = false;
    Cy_SysLib_ExitCriticalSection(interruptState);

    do
    {
        /* wait till the disable is completed */
        retStatus = I3C_Check_Timeout(&timeout);
    }
    while (retStatus == CY_I3C_SUCCESS && (_FLD2VAL(I3C_CORE_DEVICE_CTRL_ENABLE, I3C_CORE_DEVICE_CTRL(base))) != 0U);
}


/*******************************************************************************
*  Function Name: Cy_I3C_Resume
****************************************************************************//**
*
* Resumes the I3C Controller after an error state.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* When the controller enters any error condition it pauses all operation until
* user resumes manually. User must call this API once error status is returned
* for any I3C bus transactions like Read/Write or other operations.
*
*******************************************************************************/
void Cy_I3C_Resume(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);

    (void)context;

    I3C_CORE_DEVICE_CTRL(base) |= I3C_CORE_DEVICE_CTRL_RESUME_Msk;

}


/*******************************************************************************
*  Function Name: Cy_I3C_GetI2CDeviceCount
****************************************************************************//**
*
* Provides the number of I2C devices attached to the bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Number of I2C devices attached to the bus.
*
*******************************************************************************/
uint32_t Cy_I3C_GetI2CDeviceCount(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return (uint32_t)CY_I3C_BAD_PARAM;
    }

    /* Suppress a compiler warning about unused variables */
    (void) base;

    return (context->i3cController.i2cDeviceCount);
}


/*******************************************************************************
*  Function Name: Cy_I3C_GetI3CDeviceCount
****************************************************************************//**
*
* Provides the number of I3C devices attached to the bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Number of I3C devices attached to the bus.
*
*******************************************************************************/
uint32_t Cy_I3C_GetI3CDeviceCount(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return (uint32_t)CY_I3C_BAD_PARAM;
    }

    /* Suppress a compiler warning about unused variables */
    (void) base;

    return ((context->i3cController.devCount) - (context->i3cController.i2cDeviceCount));
}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerGetI2CDevices
****************************************************************************//**
*
* Provides the list of I2C devices on the bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param i2cDeviceList
* The pointer to the I2C device list array.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerGetI2CDevices(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDeviceList, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == i2cDeviceList) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    uint8_t index;
    cy_stc_i3c_controller_devlist_t *ptr = context->devList;

    for (index = 0U; index < i3cController->devCount; index++)
    {
        if (ptr->i2c)
        {
            *i2cDeviceList = ptr->i2cDevice;
            i2cDeviceList++;
        }
        ptr++;
    }
    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerGetI3CDevices
****************************************************************************//**
*
* Provides the list of I3C devices on the bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param i3cDeviceList
* The pointer to the I3C device list array.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerGetI3CDevices(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDeviceList, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == i3cDeviceList) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    uint8_t index, count;
    cy_stc_i3c_controller_devlist_t *ptr = context->devList;
    count = (uint8_t)(i3cController->devCount);

