PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    for (index = 0U; index < count; index++)
    {
        if (!ptr->i2c)
        {
            *i3cDeviceList = ptr->i3cDevice;
            i3cDeviceList++;
        }
        ptr++;
    }
    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerGetFreeDeviceAddress
****************************************************************************//**
*
* Provides the next dynamic address available to be assigned.
*
* \param base
* The pointer to the I3C instance.
*
* \param address
* The pointer to the address.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerGetFreeDeviceAddress(I3C_CORE_Type *base, uint8_t *address, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == address) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    cy_en_i3c_addr_slot_status_t status;
    uint8_t freeAddress;
    uint8_t startAddress = (i3cController->lastAddress) + 1U;

    for (freeAddress = startAddress; freeAddress < CY_I3C_MAX_ADDR; freeAddress++)
    {
        status = GetAaddrslotStatus(freeAddress, context);
        if (CY_I3C_ADDR_SLOT_FREE == status)
        {
            *address = freeAddress;
            return CY_I3C_SUCCESS;
        }
    }

    /* case when a device is detached from the bus and the address is available */
    for (freeAddress = 1U; freeAddress < startAddress; freeAddress++)
    {
        status = GetAaddrslotStatus(freeAddress, context);
        if (CY_I3C_ADDR_SLOT_FREE == status)
        {
            *address = freeAddress;
            return CY_I3C_SUCCESS;
        }
    }

    return CY_I3C_CONTROLLER_FREE_ADDR_UNAVIAL;
}


/*******************************************************************************
*  Function Name: Cy_I3C_isCCCCmdSupported
****************************************************************************//**
*
* Checks if the CCC command is supported.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The CCC command to be checked.
*
* \return
* ture: If the specified command is supported
* false: If the specified command is not supported.
*
*******************************************************************************/
bool Cy_I3C_isCCCCmdSupported(I3C_CORE_Type *base, uint8_t cccCmd)
{

    /* Suppress a compiler warning about unused variables */
    (void) base;
    bool ret = false;

    switch (cccCmd)
    {
    case CY_I3C_CCC_ENEC(true):
    case CY_I3C_CCC_ENEC(false):
    case CY_I3C_CCC_DISEC(true):
    case CY_I3C_CCC_DISEC(false):
    case CY_I3C_CCC_ENTAS(0U, true):
    case CY_I3C_CCC_ENTAS(0U, false):
    case CY_I3C_CCC_RSTDAA(true):
    case CY_I3C_CCC_RSTDAA(false):
    case CY_I3C_CCC_ENTDAA:
    case CY_I3C_CCC_SETAASA:
    case CY_I3C_CCC_SETMWL(true):
    case CY_I3C_CCC_SETMWL(false):
    case CY_I3C_CCC_SETMRL(true):
    case CY_I3C_CCC_SETMRL(false):
    case CY_I3C_CCC_SETXTIME(false):
    case CY_I3C_CCC_SETXTIME(true):
    case CY_I3C_CCC_GETXTIME:
    case CY_I3C_CCC_ENTHDR(0U):
    case CY_I3C_CCC_SETDASA:
    case CY_I3C_CCC_SETNEWDA:
    case CY_I3C_CCC_GETMWL:
    case CY_I3C_CCC_GETMRL:
    case CY_I3C_CCC_GETPID:
    case CY_I3C_CCC_GETBCR:
    case CY_I3C_CCC_GETDCR:
    case CY_I3C_CCC_GETSTATUS:
    case CY_I3C_CCC_GETMXDS:
    case CY_I3C_CCC_GETHDRCAP:
    case CY_I3C_CCC_GETACCCR:
    case CY_I3C_CCC_ENDXFER(true):
    case CY_I3C_CCC_ENDXFER(false):
    case CY_I3C_CCC_DEFTGTS:
    case CY_I3C_CCC_RSTACT(true):
    case CY_I3C_CCC_RSTACT(false):
    case CY_I3C_CCC_DEVCTRL:
    {
        ret = true;
        break;
    }
    default:
    {
        ret = false;
        break;
    }
    }
    return ret;
}


/*******************************************************************************
*  Function Name: Cy_I3C_SendCCCCmd
****************************************************************************//**
*
* Post the specified CCC command to command queue.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the CCC command description structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_SendCCCCmd(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == cccCmd) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_en_i3c_status_t retStatus;

    context->controllerStatus = CY_I3C_CONTROLLER_BUSY;
    switch (cccCmd->cmd)
    {
    case CY_I3C_CCC_ENEC(true):
    case CY_I3C_CCC_ENEC(false):
    case CY_I3C_CCC_DISEC(true):
    case CY_I3C_CCC_DISEC(false):
    {
        retStatus = enec_disec_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_RSTDAA(true):
    case CY_I3C_CCC_RSTDAA(false):
    {
        retStatus = rstdaa_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_SETMWL(true):
    case CY_I3C_CCC_SETMWL(false):
    case CY_I3C_CCC_SETMRL(true):
    case CY_I3C_CCC_SETMRL(false):
    {
        retStatus = setmrwl_ccc(base, cccCmd, context);
        break;
    }
#if CY_IP_MXI3C_VERSION_MINOR == 1u
    case CY_I3C_CCC_SETXTIME(true):
    case CY_I3C_CCC_SETXTIME(false):
    {
        retStatus = setxtime_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETXTIME:
    {
        retStatus = getxtime_ccc(base, cccCmd, context);
        break;
    }
#endif
    case CY_I3C_CCC_SETNEWDA:
    {
        retStatus = setnewda_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETMWL:
    case CY_I3C_CCC_GETMRL:
    {
        retStatus = getmrwl_ccc(base, cccCmd, context);
        break;
    }

