PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    case CY_I3C_CCC_GETPID:
    {
        retStatus = getpid_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETBCR:
    {
        retStatus = getbcr_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETDCR:
    {
        retStatus = getdcr_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETSTATUS:
    {
        retStatus = getstatus_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETMXDS:
    {
        retStatus = getmxds_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETHDRCAP:
    {
        retStatus = gethdrcap_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_ENTAS(0U, true):
    case CY_I3C_CCC_ENTAS(0U, false):
    case CY_I3C_CCC_ENTAS(1U, true):
    case CY_I3C_CCC_ENTAS(1U, false):
    case CY_I3C_CCC_ENTAS(2U, true):
    case CY_I3C_CCC_ENTAS(2U, false):
    case CY_I3C_CCC_ENTAS(3U, true):
    case CY_I3C_CCC_ENTAS(3U, false):
    {
        retStatus = entas_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_ENTHDR(0U):
    {
        retStatus = enthdr0_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_GETACCCR:
    {
        retStatus = getacccr_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_DEFTGTS:
    {
        retStatus = deftgts_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_RSTACT(true):
    case CY_I3C_CCC_RSTACT(false):
    {
        retStatus = rstact_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_ENDXFER(true):
    case CY_I3C_CCC_ENDXFER(false):
    {
        retStatus = endxfer_ccc(base, cccCmd, context);
        break;
    }
    case CY_I3C_CCC_DEVCTRL:
    {
        retStatus = devctrl_ccc(base, cccCmd, context);
        break;
    }
    default:
    {
        retStatus = CY_I3C_CONTROLLER_CCC_NOT_SUPPORTED;
        break;
    }
    }

    context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
    return retStatus;
}


/*******************************************************************************
*  Function Name: Cy_I3C_DisableDeviceIbi
****************************************************************************//**
*
* Disables all IBI events from specified device.
*
* \param base
* The pointer to the I3C instance.
*
* \param i3cDevice
* pointer to the i3c device description structure \ref cy_stc_i3c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_DisableDeviceIbi(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == i3cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ccc_cmd_t cmd = {0};
    cy_stc_i3c_ccc_events_t i3cCccENEC;
    cy_stc_i3c_ccc_payload_t payload;

    retStatus = CCCTargetAddressValidation(i3cDevice->dynamicAddress, true, context);
    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

#if CY_IP_MXI3C_VERSION_MINOR == 0u
    uint32_t bitpos = CY_I3C_IBI_TIR_REQ_ID(i3cDevice->dynamicAddress);
    I3C_CORE_IBI_TIR_REQ_REJECT(base) |= ((1UL) << bitpos); /* Setting the corresponding bit to 1: 1 -> Nack the TIR from the corresponding device */
    I3C_CORE_IBI_CR_REQ_REJECT(base) |= ((1UL) << bitpos); /* Setting the corresponding bit to 1: 1 -> Nack the MR from the corresponding device */
#else

    uint32_t value;
    uint8_t pos = (GetI3CDevAddrPos(base, i3cDevice->dynamicAddress, context));

    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
    value |= (I3C_CORE_DEV_ADDR_TABLE_LOC1_TIR_REJECT_Msk | I3C_CORE_DEV_ADDR_TABLE_LOC1_CR_REJECT_Msk);
    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

#endif

    /* Sending ENEC command */
    i3cCccENEC.events = (uint8_t)(CY_I3C_CCC_EVENT_SIR | CY_I3C_CCC_EVENT_MR);
    cmd.cmd = CY_I3C_CCC_DISEC(false);
    cmd.data = &payload;
    cmd.data->len = ((uint16_t)sizeof(i3cCccENEC));
    cmd.data->data = &(i3cCccENEC.events);
    cmd.address = i3cDevice->dynamicAddress;

    retStatus = enec_disec_ccc(base, &cmd, context);

    return retStatus;
}

/*******************************************************************************
*  Function Name: Cy_I3C_EnableDeviceIbi
****************************************************************************//**
*
* Enables all IBI events from specified device.
*
* \param base
* The pointer to the I3C instance.
*
* \param i3cDevice
* pointer to the i3c device description structure \ref cy_stc_i3c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_config_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_EnableDeviceIbi(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == i3cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ccc_cmd_t cmd = {0};
    cy_stc_i3c_ccc_events_t i3cCccENEC;
    cy_stc_i3c_ccc_payload_t payload;

    retStatus = CCCTargetAddressValidation(i3cDevice->dynamicAddress, true, context);
    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

#if CY_IP_MXI3C_VERSION_MINOR == 0u
    uint32_t bitpos = CY_I3C_IBI_TIR_REQ_ID(i3cDevice->dynamicAddress);
    I3C_CORE_IBI_TIR_REQ_REJECT(base) &= ~((1UL) << bitpos); /* Setting the corresponding bit to 0: 0 -> Ack the TIR from the corresponding device */
    I3C_CORE_IBI_CR_REQ_REJECT(base) &= ~((1UL) << bitpos); /* Setting the corresponding bit to 0: 0 -> Ack the MR from the corresponding device */
#else

    uint32_t value;
    uint8_t pos = (GetI3CDevAddrPos(base, i3cDevice->dynamicAddress, context));
    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
    value &= ~(I3C_CORE_DEV_ADDR_TABLE_LOC1_TIR_REJECT_Msk | I3C_CORE_DEV_ADDR_TABLE_LOC1_CR_REJECT_Msk);
    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

#endif

    /* Sending DISEC command */
    i3cCccENEC.events = (uint8_t)(CY_I3C_CCC_EVENT_SIR | CY_I3C_CCC_EVENT_MR);
    cmd.cmd = CY_I3C_CCC_ENEC(false);
    cmd.data = &payload;
    cmd.data->len = ((uint16_t)sizeof(i3cCccENEC));
    cmd.data->data = &(i3cCccENEC.events);
    cmd.address = i3cDevice->dynamicAddress;

    retStatus = enec_disec_ccc(base, &cmd, context);
    return retStatus;
}

