PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: Cy_I3C_SetDataRate
****************************************************************************//**
*
* Sets desired maximum I3C bus data rate for transfers.
*
* \param base
* The pointer to the I3C instance.
*
* \param dataRateHz
* The desired I3C data rate in Hz.
*
* \param i3cClockHz
* The frequency of the clock connected to the I3C Block in Hz.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The achieved data rate in Hz.
* When zero value is returned there is an error in the input parameters:
* data rate or clk_i3c is out of valid range.
*
*******************************************************************************/
uint32_t Cy_I3C_SetDataRate(I3C_CORE_Type *base, uint32_t dataRateHz, uint32_t i3cClockHz, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return (uint32_t)CY_I3C_BAD_PARAM;
    }

    CY_ASSERT_L2(i3cClockHz > 0UL);
    CY_ASSERT_L2(CY_I3C_IS_SDR_DATA_RATE_VALID(dataRateHz));

    uint32_t i3cClockPeriod; /* in nanoSeconds */
    uint32_t resDataRate;
    uint8_t hcnt, lcnt, lcnt_min;

    /* CY_I3C_DIV_ROUND_UP - quotient will be rounded to the next number in non-integer cases */
    i3cClockPeriod = CY_I3C_DIV_ROUND_UP(1000000000U, i3cClockHz); /* time period in nanoseconds */

    /* High Phase will be 41ns irrespective of whether the bus is in PureBusMode or MixedBusMode */
    hcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(CY_I3C_BUS_THIGH_MAX_NS, i3cClockPeriod) - 1U);
    if (hcnt < CY_I3C_SCL_I3C_TIMING_CNT_MIN)
    {
        hcnt = CY_I3C_SCL_I3C_TIMING_CNT_MIN;
    }

    if ((CY_I3C_DIV_ROUND_UP(i3cClockHz, dataRateHz) - hcnt) < (uint32_t)CY_I3C_SCL_I3C_TIMING_CNT_MIN)
    {
        lcnt = CY_I3C_SCL_I3C_TIMING_CNT_MIN;
    }
    else
    {
        lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(i3cClockHz, dataRateHz) - hcnt);
    }

    resDataRate = CY_I3C_DIV_ROUND_UP(1000000000U, (((uint32_t)hcnt + (uint32_t)lcnt) * i3cClockPeriod));

    I3C_CORE_SCL_I3C_PP_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_HCNT, hcnt) |
                                       _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_LCNT, lcnt);

    lcnt_min = (uint8_t)(CY_I3C_DIV_ROUND_UP(CY_I3C_BUS_TLOW_OD_MIN_NS, i3cClockPeriod)); /*minimum required lcnt value.*/
    if ((CY_I3C_DIV_ROUND_UP(i3cClockHz, context->openDrainSclRate) - hcnt) < (uint32_t)lcnt_min)
    {
        lcnt = lcnt_min;
    }
    else
    {
        lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(i3cClockHz, context->openDrainSclRate) - hcnt);
    }

    I3C_CORE_SCL_I3C_OD_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_HCNT, hcnt) |
                                       _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_LCNT, lcnt);

    I3C_CORE_BUS_FREE_AVAIL_TIMING(base) = _VAL2FLD(I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_FREE_TIME, lcnt);

    lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(i3cClockHz, CY_I3C_SDR1_DATA_RATE) - hcnt);
    I3C_CORE_SCL_EXT_LCNT_TIMING(base) |= _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_1, lcnt);
    lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(i3cClockHz,  CY_I3C_SDR2_DATA_RATE) - hcnt);
    I3C_CORE_SCL_EXT_LCNT_TIMING(base) |= _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_2, lcnt);
    lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(i3cClockHz, CY_I3C_SDR3_DATA_RATE) - hcnt);
    I3C_CORE_SCL_EXT_LCNT_TIMING(base) |= _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_3, lcnt);
    lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(i3cClockHz, CY_I3C_SDR4_DATA_RATE) - hcnt);
    I3C_CORE_SCL_EXT_LCNT_TIMING(base) |= _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_4, lcnt);

    if (CY_I3C_BUS_PURE != context->i3cBusMode)
    {
        /* Mixed mode bus */
        lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(CY_I3C_BUS_I2C_FMP_TLOW_MIN_NS, i3cClockPeriod));
        hcnt = ((uint8_t)CY_I3C_DIV_ROUND_UP(i3cClockHz, CY_I3C_I2C_FMP_DATA_RATE)) - lcnt;

        I3C_CORE_SCL_I2C_FMP_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_HCNT, hcnt) |
                                            _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_LCNT, lcnt);

        lcnt = (uint8_t)(CY_I3C_DIV_ROUND_UP(CY_I3C_BUS_I2C_FM_TLOW_MIN_NS, i3cClockPeriod));
        hcnt = ((uint8_t)CY_I3C_DIV_ROUND_UP(i3cClockHz, CY_I3C_I2C_FM_DATA_RATE) - lcnt);

        I3C_CORE_SCL_I2C_FM_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_HCNT, hcnt) |
                                           _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_LCNT, lcnt);

        /* Configure the BUS_FREE_AVAIL_TIMING register with lcnt from Fast-Mode */
        I3C_CORE_BUS_FREE_AVAIL_TIMING(base) = _VAL2FLD(I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_FREE_TIME, lcnt);

    }

    context->i3cSclRate = resDataRate;
    context->dsConfig.manualDataRate = false;
    return resDataRate;

}


/*******************************************************************************
*  Function Name: Cy_I3C_I3CGetDataRate
****************************************************************************//**
*
* Provides the supported I3C bus data rate for I3C devices.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_data_speed_t
*
*******************************************************************************/
uint32_t Cy_I3C_GetDataRate(I3C_CORE_Type const *base, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return (uint32_t)CY_I3C_BAD_PARAM;
    }

    /* Suppress a compiler warning about unused variables */
    (void) base;

