PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    return (context->i3cSclRate);
}


/*******************************************************************************
*  Function Name: Cy_I3C_IsBusBusy
****************************************************************************//**
*
* Indicates the whether the bus is busy or not.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* true: if bus is BUSY.
* false: if bus is IDLE.
*
*******************************************************************************/
bool Cy_I3C_IsBusBusy(I3C_CORE_Type const *base)
{
    CY_ASSERT_L1(NULL != base);

    uint32_t retStatus;

    retStatus = I3C_CORE_PRESENT_STATE(base) & I3C_CORE_PRESENT_STATE_CM_TFR_STS_Msk;

    if (0UL == retStatus)
    {
        return false;
    }

    return true;
}


/*******************************************************************************
*  Function Name: Cy_I3C_IsController
****************************************************************************//**
*
* indicates primary controllership status.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* true: if IP is current active controller.
* false: otherwise.
*
*******************************************************************************/
bool  Cy_I3C_IsController(I3C_CORE_Type const *base)
{
    CY_ASSERT_L1(NULL != base);

    uint32_t value = _FLD2VAL(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, I3C_CORE_DEVICE_CTRL_EXTENDED(base));

    if (I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_TARGET == value)
    {
        return false;
    }
    else
    {
        return true;
    }
}


/*******************************************************************************
*  Function Name: Cy_I3C_GetMode
****************************************************************************//**
*
* Provides the mode of the device.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* \ref cy_en_i3c_mode_t
*
*******************************************************************************/
cy_en_i3c_mode_t Cy_I3C_GetMode(I3C_CORE_Type const *base)
{
    CY_ASSERT_L1(NULL != base);

    uint32_t mode;

    mode = I3C_CORE_DEVICE_CTRL_EXTENDED(base);
    mode = _FLD2VAL(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, mode);

    if (I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_TARGET == mode)
    {
        return CY_I3C_TARGET;
    }
    else
    {
        return CY_I3C_CONTROLLER;
    }
}


/*******************************************************************************
*  Function Name: Cy_I3C_ControllerWrite
****************************************************************************//**
*
* Writes data provided by xferConfig structure \ref cy_stc_i3c_controller_xfer_config_t
* to a specific device.
*
* \param base
* The pointer to the I3C instance.
*
* \param xferConfig
* Controller transfer configuration structure.
* \ref cy_stc_i3c_controller_xfer_config_t
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerWrite(I3C_CORE_Type *base, cy_stc_i3c_controller_xfer_config_t *xferConfig, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == xferConfig) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    CY_ASSERT_L1(CY_IS_I3C_BUFFER_VALID(xferConfig->buffer, xferConfig->bufferSize));
    CY_ASSERT_L2(CY_IS_I3C_ADDR_VALID(xferConfig->targetAddress));

    if (CY_I3C_FIFO_SIZE < xferConfig->bufferSize)
    {
        return CY_I3C_BAD_BUFFER_SIZE;
    }

    cy_en_i3c_status_t retStatus = CY_I3C_CONTROLLER_NOT_READY;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

    if (0UL != (CY_I3C_IDLE_MASK & context->state))
    {
        uint8_t validBytes;
        cy_en_i3c_addr_slot_status_t res;
        uint8_t *data;
        cy_stc_i3c_ccc_t cmd;
        uint8_t pos = 0U;
        cy_stc_i3c_controller_devlist_t *i3cDeviceList;
        uint8_t writeDSMode = (uint8_t)CY_I3C_SDR0;

        context->controllerBuffer = xferConfig->buffer;
        context->controllerBufferSize = xferConfig->bufferSize;
        context->controllerBufferIdx = 0UL;
        data = context->controllerBuffer;
        context->controllerStatus = CY_I3C_CONTROLLER_BUSY;

        cmd.cmdHigh = 0UL;
        cmd.cmdLow = 0UL;

        /* Clear the interrupts */
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

        /* Reset the Tx FIFO */
        I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_TX_FIFO_RST_Msk;
        do
        {
            /* wait till the reset is completed */
            retStatus = I3C_Check_Timeout(&timeout);
        }
        while (retStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

        if (retStatus == CY_I3C_TIMEOUT)
        {
            return retStatus;
        }

        res = GetAaddrslotStatus(xferConfig->targetAddress, context);

        /* This helps to check if the device is actively present on the bus */
        if ((CY_I3C_ADDR_SLOT_I3C_DEV != res) && (CY_I3C_ADDR_SLOT_I2C_DEV != res))
        {
            return CY_I3C_BAD_PARAM;
        }

        if (CY_I3C_ADDR_SLOT_I2C_DEV == res)
        {
            /* The target device is an i2cDevice */
            pos = (uint8_t)(GetI2CDevAddrPos(base, xferConfig->targetAddress, context));
            i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
            writeDSMode = (uint8_t)((0U != (i3cDeviceList->i2cDevice.lvr & CY_I3C_LVR_I2C_MODE_INDICATOR)) ? CY_I3C_FM_I2C : CY_I3C_FMP_I2C);
            context->controllerStatus |= CY_I3C_CONTROLLER_I2C_SDR_WR_XFER;
        }

        else
        {
            /* The target is an i3cDevice */
            pos = (uint8_t)(GetI3CDevAddrPos(base, xferConfig->targetAddress, context));
            i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
            if (CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk == (i3cDeviceList->i3cDevice.bcr))
            {
                writeDSMode = (i3cDeviceList->i3cDevice.maxWriteDs) & 0x07U;
            }
            context->controllerStatus |= CY_I3C_CONTROLLER_I3C_SDR_WR_XFER;
        }

        switch (xferConfig->bufferSize)
        {
        case 1UL:
        {
            validBytes = CY_I3C_BYTE_STROBE1;
            cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_SHORT_DATA_ARG |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB, validBytes) |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0, *data);
            context->controllerBufferSize -= 1U;
            cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Msk |
                          I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;
            break;
        }
        case 2UL:
        {
            validBytes = CY_I3C_BYTE_STROBE2;
            cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_SHORT_DATA_ARG |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB, validBytes) |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0, *(data)) |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_1, *(data + 1U));
            context->controllerBufferSize -= 2U;
            cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Msk |
                          I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;
            break;
        }
        case 3UL:
        {
            validBytes = CY_I3C_BYTE_STROBE3;
            cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_SHORT_DATA_ARG |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB, validBytes) |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0, *data) |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_1, *(data + 1U)) |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_2, *(data + 2u));
            context->controllerBufferSize -= 3U;
            cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Msk |
                          I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;
            break;
        }
        default:
        {

            /* Write transfer with data greater than 3 bytes */
            ControllerHandleDataTransmit(base, context);
            if (xferConfig->toc)
            {
                cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;
            }

