PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
            cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                           _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, context->controllerBufferSize);
            break;
        }
        }

        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID, CY_I3C_CONTROLLER_SDR_WRITE_TID) |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, writeDSMode) |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk;
        if (context->devList[pos].i3cDevice.PECEnabled)
        {
            cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk;
        }
        context->state = CY_I3C_CONTROLLER_TX;

        Cy_I3C_SetInterruptMask(base, (CY_I3C_INTR_TRANSFER_ERR_STS | CY_I3C_INTR_RESP_READY_STS));
        Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_TRANSFER_ERR_STS | CY_I3C_INTR_RESP_READY_STS));

        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;

        retStatus = CY_I3C_SUCCESS;
    }

    return retStatus;
}

/*******************************************************************************
*  Function Name: Cy_I3C_ControllerRead
****************************************************************************//**
*
* Reads data from a device specified by xferConfig structure
* \ref cy_stc_i3c_controller_xfer_config_t.
*
* \param base
* The pointer to the I3C instance.
*
* \param xferConfig
* Controller transfer configuration structure.
* \ref cy_stc_i3c_controller_xfer_config_t
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerRead(I3C_CORE_Type *base, cy_stc_i3c_controller_xfer_config_t* xferConfig, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == xferConfig) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    CY_ASSERT_L1(CY_IS_I3C_BUFFER_VALID(xferConfig->buffer, xferConfig->bufferSize));
    CY_ASSERT_L2(CY_IS_I3C_ADDR_VALID(xferConfig->targetAddress));

    if (CY_I3C_FIFO_SIZE < xferConfig->bufferSize)
    {
        return CY_I3C_BAD_BUFFER_SIZE;
    }

    cy_en_i3c_status_t retStatus = CY_I3C_CONTROLLER_NOT_READY;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

    if (0UL != (CY_I3C_IDLE_MASK & context->state))
    {
        cy_stc_i3c_ccc_t cmd;
        uint8_t pos = 0U;
        cy_stc_i3c_controller_devlist_t *i3cDeviceList;
        uint8_t readDSMode = (uint8_t)CY_I3C_SDR0;
        cy_en_i3c_addr_slot_status_t res;

        context->controllerBuffer = xferConfig->buffer;
        context->controllerBufferSize = xferConfig->bufferSize;
        context->controllerBufferIdx = 0UL;
        context->controllerStatus = CY_I3C_CONTROLLER_BUSY;

        cmd.cmdHigh = 0UL;
        cmd.cmdLow = 0UL;

        /* Clear the interrupts*/
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

        /* Reset the Rx FIFO */
        I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_RX_FIFO_RST_Msk;
        do
        {
            /* wait till the reset is completed */
            retStatus = I3C_Check_Timeout(&timeout);
        }
        while (retStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

        if (retStatus == CY_I3C_TIMEOUT)
        {
            return retStatus;
        }
        res = GetAaddrslotStatus(xferConfig->targetAddress, context);

        /* This helps to check if the device is actively present on the bus */
        if ((CY_I3C_ADDR_SLOT_I3C_DEV != res) && (CY_I3C_ADDR_SLOT_I2C_DEV != res))
        {
            return CY_I3C_BAD_PARAM;
        }

        if (CY_I3C_ADDR_SLOT_I2C_DEV == res)
        {
            /* The target device is an i2cDevice */
            pos = (uint8_t)(GetI2CDevAddrPos(base, xferConfig->targetAddress, context));
            i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
            readDSMode = (uint8_t)((0U != (i3cDeviceList->i2cDevice.lvr & CY_I3C_LVR_I2C_MODE_INDICATOR)) ? CY_I3C_FM_I2C : CY_I3C_FMP_I2C);
            context->controllerStatus |= CY_I3C_CONTROLLER_I2C_SDR_RD_XFER;
        }
        else
        {
            /* The target is an i3cDevice */
            pos = (uint8_t)(GetI3CDevAddrPos(base, xferConfig->targetAddress, context));
            i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
            if (CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk == (i3cDeviceList->i3cDevice.bcr))
            {
                readDSMode = (i3cDeviceList->i3cDevice.maxReadDs) & 0x07U;
            }
            context->controllerStatus |= CY_I3C_CONTROLLER_I3C_SDR_RD_XFER;
        }

        if (xferConfig->toc)
        {
            /* There are no bytes remaining to be read from the next READ, so terminate this READ with STOP */
            cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;
        }
        cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                       _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, context->controllerBufferSize);

        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID, CY_I3C_CONTROLLER_SDR_READ_TID) |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, readDSMode) |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk;
        if (context->devList[pos].i3cDevice.PECEnabled)
        {
            cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk;
        }

        context->state = CY_I3C_CONTROLLER_RX;

