PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
        context->state = CY_I3C_CONTROLLER_TX;

        /* Disable the interrupt signals by clearing the bits */
        Cy_I3C_SetInterruptMask(base, 0UL);
        Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;

        do
        {
            /* wait till the interrupt of response is received */
            retStatus = I3C_Check_Timeout(&timeout);
        }
        while (retStatus == CY_I3C_SUCCESS && 0UL == ((CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS) & Cy_I3C_GetInterruptStatus(base)));

        if (retStatus == CY_I3C_TIMEOUT)
        {
            return retStatus;
        }

        respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

        if (0UL != (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
        {
            /* unsuccessful due to transfer error */
            retStatus = ResponseError(respCmdPort);
            context->controllerStatus |= CY_I3C_CONTROLLER_HALT_STATE;
        }

        else
        {
            retStatus = CY_I3C_SUCCESS;
        }
        context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
        context->state = CY_I3C_IDLE;
    }

    return retStatus;
}

/*******************************************************************************
*  Function Name: Cy_I3C_ControllerReadByte
****************************************************************************//**
*
* Reads one byte from a target.
* This function is blocking.
*
* \param base
* The pointer to the I3C instance.
*
* \param targetAddress
* The dynamic address of the target I3C target device.
*
* \param data
* The pointer to the location to store the Read byte.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerReadByte(I3C_CORE_Type *base, uint8_t targetAddress, uint8_t *data, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    CY_ASSERT_L2(CY_IS_I3C_ADDR_VALID(targetAddress));

    cy_en_i3c_status_t retStatus = CY_I3C_CONTROLLER_NOT_READY;

    if (0UL != (CY_I3C_IDLE_MASK & context->state))
    {
        cy_en_i3c_addr_slot_status_t res;
        cy_stc_i3c_ccc_t cmd;
        uint8_t pos = 0U;
        cy_stc_i3c_controller_devlist_t *i3cDeviceList;
        uint8_t readDSMode = (uint8_t)CY_I3C_SDR0;
        uint32_t respCmdPort, datalen;
        uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

        context->controllerStatus = CY_I3C_CONTROLLER_BUSY;

        cmd.cmdHigh = 0UL;
        cmd.cmdLow = 0UL;

        /* Clear the interrupts */
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

        /* Reset the Tx FIFO */
        I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_TX_FIFO_RST_Msk;

        do
        {
            /* wait till the reset is completed */
            retStatus = I3C_Check_Timeout(&timeout);
        }
        while (retStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

        if (retStatus == CY_I3C_TIMEOUT)
        {
            return retStatus;
        }

        res = GetAaddrslotStatus(targetAddress, context);

        /* This helps to check if the device is actively present on the bus */
        if ((CY_I3C_ADDR_SLOT_I3C_DEV != res) && (CY_I3C_ADDR_SLOT_I2C_DEV != res))
        {
            return CY_I3C_BAD_PARAM;
        }

        if (CY_I3C_ADDR_SLOT_I2C_DEV == res)
        {
            /* The target device is an i2cDevice */
            pos = (uint8_t)(GetI2CDevAddrPos(base, targetAddress, context));
            i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
            readDSMode = (uint8_t)((0U != (i3cDeviceList->i2cDevice.lvr & CY_I3C_LVR_I2C_MODE_INDICATOR)) ? CY_I3C_FM_I2C : CY_I3C_FMP_I2C);
            context->controllerStatus |= CY_I3C_CONTROLLER_I2C_SDR_RD_XFER;
        }

        else
        {
            /* The target is an i3cDevice */
            pos = (uint8_t)(GetI3CDevAddrPos(base, targetAddress, context));
            i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
            if (CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk == (i3cDeviceList->i3cDevice.bcr))
            {
                readDSMode = (i3cDeviceList->i3cDevice.maxReadDs) & 0x07U;
            }
            context->controllerStatus |= CY_I3C_CONTROLLER_I3C_SDR_RD_XFER;
        }

        cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                       _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, 1U);

        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, readDSMode) |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;
        if (context->devList[pos].i3cDevice.PECEnabled)
        {
            cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk;
        }

        context->state = CY_I3C_CONTROLLER_RX;

        /* Disable the interrupt signals by clearing the bits */
        Cy_I3C_SetInterruptMask(base, 0UL);
        Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;

        do
        {
            /* wait till the interrupt of response is received */
            retStatus = I3C_Check_Timeout(&timeout);
        }
        while (retStatus == CY_I3C_SUCCESS && 0UL == ((CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS) & Cy_I3C_GetInterruptStatus(base)));

        if (retStatus == CY_I3C_TIMEOUT)
        {
            return retStatus;
        }

        respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
        Cy_I3C_SetInterruptStatusMask(base, 0UL);

        if (0UL != (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
        {
            retStatus = ResponseError(respCmdPort);    /* unsuccessful due to transfer error */
            context->controllerStatus |= CY_I3C_CONTROLLER_HALT_STATE;
        }

        else
        {
            datalen = (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk);
            if (1UL == datalen)
            {
                *data = (uint8_t)Cy_I3C_ReadRxFIFO(base);
                retStatus = CY_I3C_SUCCESS;
            }
            else
            {
                retStatus = CY_I3C_CONTROLLER_ERROR_CE0;
            }
        }
        context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
        context->state = CY_I3C_IDLE;
    }

