PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    return retStatus;
}

/*******************************************************************************
*  Function Name: Cy_I3C_GetBusStatus
****************************************************************************//**
*
* Returns the current I3C bus status.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref group_i3c_macros_controller_status.
* Note that not all I3C controller statuses are returned by this function. Refer to
* more details of each status.
*
*******************************************************************************/
uint32_t Cy_I3C_GetBusStatus(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return (uint32_t)CY_I3C_BAD_PARAM;
    }

    (void) base;

    if (CY_I3C_CONTROLLER == Cy_I3C_GetMode(base))
    {
        return (context->controllerStatus);
    }
    else
    {
        return (context->targetStatus);
    }

}

/* DAA */
/* About DAA:
1. This has the responsibility of finding the number of devices required to be assigned dynamic addresses
2. Getting the free addresses
3. Populating the DAT
4. Populating the COMMAND DATA PORT
5. Poll for the response and update the DAT free pos index based on the response received */

/*******************************************************************************
*  Function Name: Cy_I3C_ControllerStartEntDaa
****************************************************************************//**
*
* Issues ENTDAA CCC command to discover the i3c devices on the bus and assigns
* valid dynamic addresses to the discovered devices.
* This CCC is to be issued also when a device hot joins the bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerStartEntDaa(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    cy_stc_i3c_device_t i3cDev;
    uint32_t i3cDevCount; /* to store the number of devices to be assigned the dynamic address */
    uint8_t dynamicAddress;
    uint8_t index, parity, pos;
    uint32_t respCmdPort;
    uint16_t respLeftDevCount;
    uint32_t value;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ccc_cmd_t cccCmd = {0};
    cy_stc_i3c_ccc_payload_t payload;

    if (CY_I3C_MAX_DEVS <= (i3cController->devCount)) /* cannot initialize the device as the bus already has 11 devices on it */
    {
        return CY_I3C_CONTROLLER_MAX_DEVS_PRESENT;
    }

    i3cDevCount = CY_I3C_MAX_DEVS - (i3cController->devCount);

    /* Get "free address" position */
    pos = (uint8_t)(GetDATFreePos(base, context));

    /* Get the 'i3cDevCount' number of free addresses and populate the DAT before issuing ENTDAA CCC */
    for (index = pos; index < i3cDevCount; index++)
    {
        retStatus = Cy_I3C_ControllerGetFreeDeviceAddress(base, &dynamicAddress, context);
        if (CY_I3C_CONTROLLER_FREE_ADDR_UNAVIAL == retStatus)
        {
            return retStatus;
        }

        parity = even_parity(dynamicAddress);
        i3cController->lastAddress = dynamicAddress;
        dynamicAddress |= (parity << 7U);

        /* populate the device address table with the dynamic address of the device */
        value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, dynamicAddress);

        Cy_I3C_WriteIntoDeviceAddressTable(base, index, value);
    }

    context->controllerStatus = CY_I3C_CONTROLLER_BUSY | CY_I3C_CONTROLLER_ENTDAA_XFER;

    /* Disable the interrupt signals by clearing the bits */
    Cy_I3C_SetInterruptMask(base, 0UL);
    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Intentional typecast of CY_I3C_CCC_ENTDAA to uint32_t.')
    I3C_CORE_COMMAND_QUEUE_PORT(base) = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_ADDR_ASSGN_CMD |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_CMD, CY_I3C_CCC_ENTDAA) |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_INDX, pos) |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_COUNT, i3cDevCount) |
                                        I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_ROC_Msk |
                                        I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TOC_Msk;
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')

    /* Handling the response */
    do
    {
        retStatus = I3C_Check_Timeout(&timeout);
        /* wait till the interrupt of response is received */
    }
    while (retStatus == CY_I3C_SUCCESS && 0UL == (CY_I3C_INTR_MASK & Cy_I3C_GetInterruptStatus(base)));

    if (retStatus == CY_I3C_TIMEOUT)
    {
        return retStatus;
    }

    respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
    Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

    respLeftDevCount = (uint16_t)(respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk); /* Represents the remaining device count */

    i3cController->lastAddress = i3cController->lastAddress - (uint8_t)respLeftDevCount;

    if (0UL != (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
    {
        if (I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_BROADCAST_ADDR_NACK_ERROR != (_FLD2VAL(I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS, respCmdPort)))
        {
            /* Error in transfer */
            retStatus = ResponseError(respCmdPort);
            context->controllerStatus |= CY_I3C_CONTROLLER_HALT_STATE;
            context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
            return retStatus;
        }
    }

