PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    Cy_I3C_Resume(base, context);

    i3cController->dynAddrDevCount = (uint32_t)(i3cDevCount - respLeftDevCount);
    i3cController->devCount += i3cController->dynAddrDevCount;

    /* Maintaining a local list of i3c devices */
    for (index = 0U; index < i3cController->dynAddrDevCount; index++)
    {
        (void)memset(&i3cDev, 0, sizeof(cy_stc_i3c_device_t));
        Cy_I3C_ReadFromDevCharTable(base, index, &i3cDev);
        SetAddrslotStatus(i3cDev.dynamicAddress, CY_I3C_ADDR_SLOT_I3C_DEV, context);
        (void)RetrieveI3CDeviceInfo(base, &i3cDev, false, context);
#if CY_IP_MXI3C_VERSION_MINOR == 1u
        if (i3cDev.ibipayloadSize > 0U)
        {
            EnableIbiPayload(base, i3cDev.dynamicAddress, context);
        }
#endif
        i3cDev.staticAddress = 0U;
        Cy_I3C_UpdateI3CDevInList(&i3cDev, pos, context);
        i3cController->freePos &= ~(CY_I3C_BIT(pos));
        pos++;
    }

    if (0UL != i3cController->dynAddrDevCount)
    {
        /* Send DEFTGTS and ENEC CCC commands */
        cccCmd.address = CY_I3C_BROADCAST_ADDR;
        cccCmd.cmd = CY_I3C_CCC_DEFTGTS;
        cccCmd.data = &payload;
        (void)deftgts_ccc(base, &cccCmd, context);
    }

    context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: Cy_I3C_SetDASA
****************************************************************************//**
*
* Set Dynamic Address from Static Address Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_SetDASA(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint8_t pos, dynAddr;
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    cy_stc_i3c_device_t i3cDevice = {0};

    /* Expects 1 byte of data */
    if (1U != cccCmd->data->len)
    {
        return CY_I3C_BAD_PARAM;
    }

    context->controllerStatus |= CY_I3C_CONTROLLER_DIRECTED_CCC_WR_XFER;

    pos = (uint8_t)(GetDATFreePos(base, context));

    setda_ccc(base, cccCmd, context);

    /* Handling the response */
    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    dynAddr = *(uint8_t *)(cccCmd->data->data);

    /* Maintaining a local list of i3c devices */
    i3cDevice.dynamicAddress = dynAddr;
    i3cDevice.staticAddress = cccCmd->address;
    SetAddrslotStatus(dynAddr, CY_I3C_ADDR_SLOT_I3C_DEV, context);
    (void)RetrieveI3CDeviceInfo(base, &i3cDevice, true, context);
#if CY_IP_MXI3C_VERSION_MINOR == 1u
    if (i3cDevice.ibipayloadSize > 0U)
    {
        EnableIbiPayload(base, dynAddr, context);
    }
#endif
    Cy_I3C_UpdateI3CDevInList(&i3cDevice, pos, context);

    (i3cController->freePos) =  ~(CY_I3C_BIT(pos));
    (i3cController->devCount)++;

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: Cy_I3C_SetAASA
****************************************************************************//**
*
* Set All Addresses to Static Address Command.
* This CCC allows the Controller to request that all connected Targets that have
* I2C Static Addresses use their I2C Static Address as their Dynamic Address.
*
* \param base
* The pointer to the I3C instance.
*
* \param i3cDevice
* The pointer to the array of i3c device description structure \ref cy_stc_i3c_device_t.
*
* \param i3cDeviceCount
* Number of I3C devices in array.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
* \note
* This is an optional CCC and caller must know all targets supporting the ccc and their static address.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_SetAASA(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, uint8_t i3cDeviceCount, cy_stc_i3c_context_t *context)
{
    uint8_t pos, dynAddr, index, parity;
    cy_en_i3c_status_t retStatus;
    uint32_t value;
    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);

    cy_stc_i3c_ccc_cmd_t cccCmd = {0};
    cy_stc_i3c_ccc_payload_t payload;
    cccCmd.cmd = CY_I3C_CCC_SETAASA;
    cccCmd.address = CY_I3C_BROADCAST_ADDR;
    cccCmd.data = &payload;
    cccCmd.data->len = 0;

    context->controllerStatus |= CY_I3C_CONTROLLER_BROADCAST_CCC_WR_XFER;
    CCC_Set(base, &cccCmd, context);

    /* Handling the response */
    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    i3cController->dynAddrDevCount += (uint32_t)(i3cDeviceCount);
    i3cController->devCount += i3cController->dynAddrDevCount;

    for (index = 0U; index < i3cDeviceCount; index++)
    {
        /* Updating the Device Address Table */
        pos = (uint8_t)(GetDATFreePos(base, context));
        i3cDevice->dynamicAddress = i3cDevice->staticAddress;
        dynAddr = i3cDevice->dynamicAddress;
        parity = even_parity(dynAddr);
        (dynAddr) |= (parity << 7U);
        value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, dynAddr) | _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, i3cDevice->staticAddress);
        Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

        /* Maintaining a local list of i3c devices */
        SetAddrslotStatus(i3cDevice->dynamicAddress, CY_I3C_ADDR_SLOT_I3C_DEV, context);
        (void)RetrieveI3CDeviceInfo(base, i3cDevice, true, context);
#if CY_IP_MXI3C_VERSION_MINOR == 1u
        if (i3cDevice->ibipayloadSize > 0U)
        {
            EnableIbiPayload(base, i3cDevice->dynamicAddress, context);
        }
#endif
        Cy_I3C_UpdateI3CDevInList(i3cDevice, pos, context);
        i3cController->freePos &= ~(CY_I3C_BIT(pos));
        i3cDevice++;
    }

