PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: Cy_I3C_ControllerSendHdrCmds
****************************************************************************//**
*
* Writes data provided by xferConfig structure \ref cy_stc_i3c_controller_xfer_config_t
* to a specific device.
*
* \param base
* The pointer to the I3C instance.
*
* \param targetAddress
* The dynamic address of the target I3C device.
*
* \param hdrCmd
* The pointer to HDR command description structure \ref cy_stc_i3c_hdr_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerSendHdrCmds(I3C_CORE_Type *base, uint8_t targetAddress, cy_stc_i3c_hdr_cmd_t *hdrCmd, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == hdrCmd) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    uint8_t pos;
    cy_en_i3c_addr_slot_status_t res;
    cy_en_i3c_status_t retStatus = CY_I3C_CONTROLLER_NOT_READY;

    if (0UL != (CY_I3C_IDLE_MASK & context->state))
    {
        res = GetAaddrslotStatus(targetAddress, context);

        /* This helps to check if the device is actively present on the bus */
        if ((CY_I3C_ADDR_SLOT_I3C_DEV != res) && (CY_I3C_ADDR_SLOT_I2C_DEV != res))
        {
            return CY_I3C_BAD_PARAM;
        }

        pos = (uint8_t)(GetI3CDevAddrPos(base, targetAddress, context));

        cy_stc_i3c_controller_devlist_t *i3cDevice = &(context->devList[pos]);

        if (false == (i3cDevice->i3cDevice.hdrSupport))
        {
            /* The device doesn't support HDR mode */
            return CY_I3C_NOT_HDR_CAP;
        }

        if (0UL != (hdrCmd->code & CY_I3C_HDR_IS_READ_CMD))
        {
            /* Read command */
            uint32_t numToRead;
            numToRead = (hdrCmd->ndatawords * 2UL);
            context->hdrCmd = hdrCmd;
            context->controllerBuffer = (uint8_t *)hdrCmd->data.in;
            context->controllerBufferSize = numToRead;
            context->destDeviceAddr = targetAddress;
            context->controllerStatus = CY_I3C_CONTROLLER_BUSY;

            ControllerHDRRead(base, hdrCmd, context);
        }

        else
        {
            /* WRITE command */
            context->hdrCmd = hdrCmd;
            context->controllerBuffer = (uint8_t *)hdrCmd->data.out;
            context->controllerBufferSize = (hdrCmd->ndatawords * 2UL);
            context->destDeviceAddr = targetAddress;
            context->controllerStatus = CY_I3C_CONTROLLER_BUSY;

            ControllerHDRWrite(base, hdrCmd, context);
        }
        retStatus = CY_I3C_SUCCESS;
    }

    return retStatus;
}

/*******************************************************************************
*  Function Name: Cy_I3C_Interrupt
****************************************************************************//**
*
* This is an I3C interrupt handler helper function.
* This function must be called inside the user-defined interrupt service.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_Interrupt(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);


    if (context->i3cMode == CY_I3C_CONTROLLER)
    {
        /* Execute a transfer as a Controller */
        Cy_I3C_ControllerInterrupt(base, context);
    }
    else
    {
        /* Execute a transfer as a Target */
#if CY_IP_MXI3C_VERSION_MINOR == 1u
        Cy_I3C_TargetInterrupt(base, context);
#endif
    }
}


/*******************************************************************************
* Function Name: Cy_I3C_RegisterEventCallback
****************************************************************************//**
*
* Registers an event handler callback function of type cy_cb_i3c_handle_events_t
* which will be invoked by the PDL to indicate i3c events and results.
*
* \param base
* The pointer to the I3C instance.
*
* \param callback
* The pointer to a callback function.
* See \ref cy_cb_i3c_handle_events_t for the function prototype.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* To remove the callback, pass NULL as the pointer to the callback function.
*
*******************************************************************************/
void Cy_I3C_RegisterEventCallback(I3C_CORE_Type const *base, cy_cb_i3c_handle_events_t callback, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);

    /* Suppress a compiler warning about unused variable */
    (void) base;

    context->cbEvents = callback;
}

/*******************************************************************************
* Function Name: Cy_I3C_RegisterIbiCallback
****************************************************************************//**
*
* Registers an IBI handler callback function of type cy_cb_i3c_handle_ibi_t
* which will be invoked when an IBI event is triggered on bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param callback
* The pointer to a callback function.
* See \ref cy_cb_i3c_handle_events_t for the function prototype.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* To remove the callback, pass NULL as the pointer to the callback function.
*
*******************************************************************************/
void Cy_I3C_RegisterIbiCallback(I3C_CORE_Type const *base, cy_cb_i3c_handle_ibi_t callback, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);

