PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    /* Suppress a compiler warning about unused variable */
    (void) base;

    context->cbIbi = callback;
}

/*******************************************************************************
* Function Name: Cy_I3C_RegisterCCCRespCallback
****************************************************************************//**
*
* Registers an event handler callback function of type cy_cb_i3c_handle_ccc_response_t
* which will be invoked by the PDL to indicate ccc response received by target.
*
* \param base
* The pointer to the I3C instance.
*
* \param callback
* The pointer to a callback function.
* See \ref cy_cb_i3c_handle_ccc_response_t for the function prototype.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* To remove the callback, pass NULL as the pointer to the callback function.
*
*******************************************************************************/
#if CY_IP_MXI3C_VERSION_MINOR == 1u || defined(CY_DOXYGEN)
void Cy_I3C_RegisterCCCRespCallback(I3C_CORE_Type const *base, cy_cb_i3c_handle_ccc_response_t callback, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);

    /* Suppress a compiler warning about unused variable */
    (void) base;

    context->cccRespEvents = callback;
}

/*******************************************************************************
* Function Name: Cy_I3C_TargetGetcccData
****************************************************************************//**
*
* Read data received from controller write CCC into given buffer.
* This function must be called from ccc response callback handler.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* Read buffer pointer for ccc data.
*
* \param size
* Number of bytes of data received. Size in indicated in CCC response event callback.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* reset successful status - CY_I3C_BAD_BUFFER_SIZE / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_TargetGetcccData(I3C_CORE_Type *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context)
{
    CY_UNUSED_PARAMETER(context); /* Suppress a compiler warning about unused variables */
    uint32_t maxEntries = ((CY_I3C_FIFO_SIZE / 4UL) - Cy_I3C_GetFreeEntriesInRxFifo(base)) * 4U;
    if (maxEntries < size)
    {
        return CY_I3C_BAD_BUFFER_SIZE;
    }
    /* Read from the RX FIFO */
    ReadArray(base, buffer, size);
    return CY_I3C_SUCCESS;
}
/*******************************************************************************
*  Function Name: Cy_I3C_TargetGetDynamicAddress
****************************************************************************//**
*
* Provides the controller assigned dynamic address of the target device.
*
* \param base
* The pointer to the I3C instance.
*
* \param address
* The pointer to the address.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_TargetGetDynamicAddress(I3C_CORE_Type const *base, uint8_t *address, cy_stc_i3c_context_t const *context)
{
    if ((NULL == base) || (NULL == address) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    if (0UL != (_FLD2VAL(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID, I3C_CORE_DEVICE_ADDR(base))))
    {
        *address = (uint8_t)_FLD2VAL(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, I3C_CORE_DEVICE_ADDR(base));
        return CY_I3C_SUCCESS;
    }

    return CY_I3C_ADDR_INVALID;
}

/*******************************************************************************
*  Function Name: Cy_I3C_TargetGetMaxReadLength
****************************************************************************//**
*
* Provides the maximum data read length of the target.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Max data read length.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
uint32_t Cy_I3C_TargetGetMaxReadLength(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);
    CY_UNUSED_PARAMETER(context); /* Suppress a compiler warning about unused variables */

    return (uint32_t)_FLD2VAL(I3C_CORE_TGT_MAX_LEN_MRL, I3C_CORE_TGT_MAX_LEN(base));
}

/*******************************************************************************
*  Function Name: Cy_I3C_TargetGetMaxWriteLength
****************************************************************************//**
*
* Provides the maximum data write length of the target.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Max write data length.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
uint32_t Cy_I3C_TargetGetMaxWriteLength(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);
    CY_UNUSED_PARAMETER(context); /* Suppress a compiler warning about unused variables */

