PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    return (uint32_t)_FLD2VAL(I3C_CORE_TGT_MAX_LEN_MWL, I3C_CORE_TGT_MAX_LEN(base));
}

/*******************************************************************************
*  Function Name: Cy_I3C_TargetGenerateIbi
****************************************************************************//**
*
* Generates the specified IBI on the bus. After calling this function, IP will continuously try to generate ibi until
* it is acked or controller sends DISEC CCC. Event callback is generated to indicate the status of IBI.
*
* \param base
* The pointer to the I3C instance.
*
* \param ibitype
* The pointer to the ibi structure \ref cy_stc_i3c_ibi_t containing the
* type of ibi event to be generated.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_TargetGenerateIbi(I3C_CORE_Type *base, cy_stc_i3c_ibi_t *ibitype, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == ibitype) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    uint8_t index;
    uint32_t value = 0UL;
    cy_en_i3c_status_t ret = CY_I3C_SUCCESS;

    /* Generate a TIR */
    if (CY_I3C_IBI_SIR == ibitype->event)
    {
        if (0UL != (_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_TIR_EN, I3C_CORE_TGT_EVENT_STATUS(base))))
        {
            /* When set, the controller attempts to issue the TIR on the bus. Once set, the application cannot clear this bit
            TIR_CTRL field of this reg is to be set to 0 */
            if (ibitype->payloadSize > 4U)
            {
                return CY_I3C_BAD_BUFFER_SIZE;
            }

            if (ibitype->payloadSize > 0U)
            {
                if (((uintptr_t)ibitype->payload % (uintptr_t)4U) == 0UL)     //checking 4 byte alignment
                {
                    value = (*(uint32_t *)ibitype->payload) & (~(0xFFFFFFFFUL << (ibitype->payloadSize * 8U)));
                }
                else
                {
                    for (index = 0; index < ibitype->payloadSize; index++)
                    {
                        value |= *(ibitype->payload + index) << (index * 8U);
                    }
                }
            }
            I3C_CORE_TGT_INTR_REQ(base) = _VAL2FLD(I3C_CORE_TGT_INTR_REQ_MDB, ibitype->mdb) | _VAL2FLD(I3C_CORE_TGT_INTR_REQ_TIR_DATA_LENGTH, ibitype->payloadSize);
            base->TGT_TIR_DATA = value;
            if (context->ATM0Enabled)
            {
                I3C->TIMING_CNT_CTRL |= I3C_TIMING_CNT_CTRL_CNT_RESET_Msk;
                I3C_CORE_TGT_INTR_REQ(base) |= I3C_CORE_TGT_INTR_REQ_TS_Msk;
            }

            I3C_CORE_TGT_INTR_REQ(base) |= I3C_CORE_TGT_INTR_REQ_TIR_Msk;

        }
        else
        {
            /* Return that Controller has disabled TIR IBI */
            return CY_I3C_SIR_DISABLED;
        }
    }

    /* Generate a controllership request */
    else if ((CY_I3C_IBI_CONTROLLER_REQ == ibitype->event) && (CY_I3C_SECONDARY_CONTROLLER == context->i3cMode))
    {
        if (0UL != (_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_CR_EN, I3C_CORE_TGT_EVENT_STATUS(base))))
        {
            /* When set, the controller attempts to issue the CR on the bus. Once set, the application cannot clear this bit */
            I3C_CORE_TGT_INTR_REQ(base) = I3C_CORE_TGT_INTR_REQ_CR_Msk;
        }
        else
        {
            /* Return that Controller has disabled CR IBI */
            return CY_I3C_CR_DISABLED;
        }
    }

    else
    {
        /*
            When targets initiates a hot-join ibi generation event or
            when a non-secondary controller tries requesting for Controllership
        */
        return CY_I3C_BAD_EVENT_REQ;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_I3C_TargetConfigReadBuf
****************************************************************************//**
*
* Configures the buffer pointer and the read buffer size. This is the buffer
* from which the controller reads data. After this function is called, data
* transfer from the read buffer to the controller is handled by
* \ref Cy_I3C_Interrupt.
*
* When the Read transaction is completed \ref CY_I3C_TARGET_WR_CMPLT is set.
* Also the \ref CY_I3C_TARGET_WR_CMPLT_EVENT event is generated.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to the buffer with data to be read by the controller.
*
* \param size
* Size of the buffer.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
void Cy_I3C_TargetConfigReadBuf(I3C_CORE_Type *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);
    CY_ASSERT_L1(CY_IS_I3C_BUFFER_VALID(buffer, size));

    /* Suppress a compiler warning about unused variables */
    (void) base;

    context->targetTxBuffer     = buffer;
    context->targetTxBufferSize = size;
    context->targetTxBufferIdx  = 0UL;
    context->targetTxBufferCnt  = 0UL;

    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_TX_BUFFER_THLD_STS | Cy_I3C_GetInterruptStatusMask(base)));
    Cy_I3C_SetInterruptMask(base, (CY_I3C_INTR_TX_BUFFER_THLD_STS | Cy_I3C_GetInterruptMask(base)));

    I3C_CORE_COMMAND_QUEUE_PORT(base) = _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TARGET_TRANSMIT_DATA_LENGTH, size);
}

