PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
/*******************************************************************************
* Function Name: Cy_I3C_TargetGetReadTransferCount
****************************************************************************//**
*
* Returns the number of bytes read by the controller since the last time
* \ref Cy_I3C_TargetConfigReadBuf was called.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The number of bytes read by the controller.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
uint32_t Cy_I3C_TargetGetReadTransferCount(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    CY_ASSERT_L1(NULL != base);

    /* Suppress a compiler warning about unused variables */
    (void)base;

    return (context->targetTxBufferCnt);
}

/*******************************************************************************
* Function Name: Cy_I3C_TargetConfigWriteBuf
****************************************************************************//**
*
* Configures the buffer pointer and the write buffer size. This is the buffer
* that the controller writes data to. After this function is called, data
* transfer from the controller into the write buffer is handled by
* \ref Cy_I3C_Interrupt.
*
* When the write transaction is completed \ref CY_I3C_TARGET_RD_CMPLT is set.
* Also the \ref CY_I3C_TARGET_RD_CMPLT_EVENT event is generated.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to buffer to store data written by the controller.
*
* \param size
* Size of the buffer.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/

void Cy_I3C_TargetConfigWriteBuf(I3C_CORE_Type const *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);
    CY_ASSERT_L1(CY_IS_I3C_BUFFER_VALID(buffer, size));

    /* Suppress a compiler warning about unused variables */
    (void) base;

    context->targetRxBuffer     = buffer;
    context->targetRxBufferSize = size;
    context->targetRxBufferIdx  = 0UL;
}

/*******************************************************************************
* Function Name: Cy_I3C_TargetGetWriteTransferCount
****************************************************************************//**
*
* Returns the number of bytes written by the controller since the last time
* \ref Cy_I3C_TargetConfigWriteBuf was called.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The number of bytes written by the controller.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
uint32_t Cy_I3C_TargetGetWriteTransferCount(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    CY_ASSERT_L1(NULL != base);

    /* Suppress a compiler warning about unused variables */
    (void) base;

    return (context->targetRxBufferCnt);
}
#endif

/*******************************************************************************
* Function Name: Cy_I3C_DeliverControllership
****************************************************************************//**
* Delivers the bus controllership to the requesting secondary controller.
*
* \param base
* The pointer to the I3C instance.
*
* \param SecControllerAddress
* The address of the I3C device to which the controllership has to be delivered.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* This should be called by the user when a controllership request IBI is received
* through cy_cb_i3c_handle_ibi_t callback and user wants to deliver controller ship.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_DeliverControllership(I3C_CORE_Type *base, uint8_t SecControllerAddress, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    cy_stc_i3c_ccc_cmd_t cccCmd = {0};
    cy_stc_i3c_ccc_getacccr_t getacccr;
    cy_stc_i3c_ccc_payload_t payload;
    uint8_t addr;
    cy_en_i3c_status_t errorStatus;

    addr = SecControllerAddress;

    cccCmd.address = addr;
    cccCmd.cmd = ((uint8_t)CY_I3C_CCC_GETACCCR);
    cccCmd.data = &payload;
    cccCmd.dbp = false;
    cccCmd.data->data = &(getacccr.newcontroller);

    errorStatus = getacccr_ccc(base, &cccCmd, context);
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

    if (CY_I3C_SUCCESS == errorStatus)
    {
        if (addr != (getacccr.newcontroller >> 1U))
        {
            errorStatus = CY_I3C_ADDR_MISMATCH;
        }

        else
        {
            /* Controllership is transferred and the controller is in the Target Mode */

            uint32_t value;

            value = _FLD2VAL(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, I3C_CORE_DEVICE_CTRL_EXTENDED(base));

