PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
            if (I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_TARGET == value)
            {
                /* Mode is changed to target */
                cy_en_i3c_status_t  status;

                Cy_I3C_Resume(base, context);
                I3C_CORE_RESET_CTRL(base) |= (I3C_CORE_RESET_CTRL_IBI_QUEUE_RST_Msk | I3C_CORE_RESET_CTRL_SOFT_RST_Msk);

                do
                {
                    /* wait till the reset is completed */
                    errorStatus = I3C_Check_Timeout(&timeout);
                }
                while (errorStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

                if (errorStatus == CY_I3C_TIMEOUT)
                {
                    return errorStatus;
                }

                status = SecondaryControllerInit(base, false, context);

                return status;
            }

        }
    }
    return errorStatus;
}


/*******************************************************************************
* Function Name: Cy_I3C_RequestControllership
****************************************************************************//**
*
* Requests controllership from the current controller.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
#if CY_IP_MXI3C_VERSION_MINOR == 1u || defined(CY_DOXYGEN)
cy_en_i3c_status_t Cy_I3C_RequestControllership(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if ((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    if (CY_I3C_SECONDARY_CONTROLLER != context->i3cMode)
    {
        return CY_I3C_NOT_SECONDARY_CONTROLLER;
    }

    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ibi_t ibi;

    retStatus = Cy_I3C_TargetGetDynamicAddress(base, &(ibi.targetAddress), context);

    if (CY_I3C_SUCCESS == retStatus)
    {
        ibi.event = CY_I3C_IBI_CONTROLLER_REQ;
        retStatus = Cy_I3C_TargetGenerateIbi(base, &ibi, context);
    }

    return retStatus;
}
#endif
/*******************************************************************************
* Function Name: SecondaryControllerInit
****************************************************************************//**
*
* This function does the basic Controller Mode configurations when the operation
* mode of the Secondary Controller is changed from I3C Target to I3C Controller.
*
* \param base
* The pointer to the I3C instance.
*
* \param isController
* true: Controller mode initializations.
* false: Target mode initializations.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static cy_en_i3c_status_t SecondaryControllerInit(I3C_CORE_Type *base, bool isController, cy_stc_i3c_context_t *context)
{
    if (isController)
    {
        context->i3cMode = CY_I3C_CONTROLLER;

        cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
        uint8_t address, idx, parity;
        uint32_t value;
        uint8_t staticAddress, dynamicAddress, dcr, bcr, i2c;
        cy_stc_i3c_device_t i3cDevice;
        cy_stc_i2c_device_t i2cDevice;
        uint32_t *sec_dev_char_table_ptr;

        i3cController->freePos = 0x7FFUL;
        i3cController->lastAddress = 0U;
        i3cController->devCount = 0U;
        i3cController->i2cDeviceCount = 0U;
        i3cController->dynAddrDevCount = 0U;

        address = (uint8_t)(_FLD2VAL(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, I3C_CORE_DEVICE_ADDR(base)));

        InitAddrslots(context);
        SetAddrslotStatus(address, CY_I3C_ADDR_SLOT_I3C_DEV, context);

        if (!context->dsConfig.manualDataRate)
        {
            (void)Cy_I3C_SetDataRate(base, context->i3cSclRate, context->i3cClockHz, context);
        }
        else
        {
            I3C_CORE_SCL_I3C_OD_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_HCNT, context->dsConfig.openDrainHighCnt) |
                                               _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_LCNT, context->dsConfig.openDrainLowCnt);
            I3C_CORE_SCL_I3C_PP_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_HCNT, context->dsConfig.pushPullHighCnt) |
                                               _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_LCNT, context->dsConfig.pushPullLowCnt);
            I3C_CORE_SCL_I2C_FM_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_HCNT, context->dsConfig.i2cFMHighCnt) |
                                               _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_LCNT, context->dsConfig.i2cFMLowCnt);
            I3C_CORE_SCL_I2C_FMP_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_HCNT, context->dsConfig.i2cFMPlusHighCnt) |
                                                _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_LCNT, context->dsConfig.i2cFMPlusLowCnt);
            I3C_CORE_SCL_EXT_LCNT_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_1, context->dsConfig.extLowCnt1) |
                                                 _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_2, context->dsConfig.extLowCnt2) |
                                                 _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_3, context->dsConfig.extLowCnt3) |
                                                 _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_4, context->dsConfig.extLowCnt4);
            I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING(base) = _VAL2FLD(I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING_I3C_EXT_TERMN_LCNT, context->dsConfig.extTerminationLowCnt);
        }

