PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
        I3C_CORE_DEVICE_CTRL(base) &= ~(_VAL2FLD(I3C_CORE_DEVICE_CTRL_IBA_INCLUDE, 1UL) | _VAL2FLD(I3C_CORE_DEVICE_CTRL_HOT_JOIN_CTRL, 1UL));

        I3C_CORE_DEVICE_CTRL(base) |= _VAL2FLD(I3C_CORE_DEVICE_CTRL_IBA_INCLUDE, context->dsConfig.ibaInclude ? 1UL : 0UL) |
                                      _VAL2FLD(I3C_CORE_DEVICE_CTRL_HOT_JOIN_CTRL, context->dsConfig.hotJoinCtrl ? 1UL : 0UL);

        I3C_CORE_BUS_FREE_AVAIL_TIMING(base) |= _VAL2FLD(I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_FREE_TIME, context->dsConfig.busFreeTime);

        I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING(base) = _VAL2FLD(I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_TX_HOLD, context->dsConfig.sdaHoldTime);

        I3C_CORE_QUEUE_THLD_CTRL(base) = _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD, context->dsConfig.cmdQueueEmptyThld) |
                                         _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, context->dsConfig.respQueueThld) |
                                         _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD, context->dsConfig.ibiQueueThld);

#if CY_IP_MXI3C_VERSION_MINOR == 1u
        CY_ASSERT_L2(CY_IS_I3C_IBI_DATA_THLD_VALID(context->dsConfig.ibiDataThld));
        I3C_CORE_QUEUE_THLD_CTRL(base) |= _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_DATA_THLD, context->dsConfig.ibiDataThld);
#endif
        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

        for (idx = 0U; idx < context->deftgts_count; idx++)
        {
            (void)memset(&i3cDevice, 0, sizeof(cy_stc_i3c_device_t));
            sec_dev_char_table_ptr = (uint32_t *) & (I3C_CORE_DEV_CHAR_TABLE1_LOC1(base)) + idx;

            staticAddress = (uint8_t)(*sec_dev_char_table_ptr & 0xFFUL);
            dynamicAddress = (uint8_t)((*sec_dev_char_table_ptr & 0xFF000000UL) >> 25UL);
            bcr = (uint8_t)((*sec_dev_char_table_ptr & 0xFF00UL) >> 8UL);
            dcr = (uint8_t)((*sec_dev_char_table_ptr & 0xFF0000UL) >> 16UL);

            i2c = (0U != dynamicAddress) ? 0U : 1U;

            parity = even_parity(dynamicAddress);
            dynamicAddress |= (parity << 7U);
            value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, dynamicAddress) |
                    _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, staticAddress) |
                    _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC10_LEGACY_I2C_DEVICE, i2c);
            dynamicAddress &= ~(parity << 7U);

#if CY_IP_MXI3C_VERSION_MINOR == 1u
            if ((bool)(bcr & CY_I3C_CORE_BCR_IBI_PAYLOAD_Msk))
            {
                value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_WITH_DATA_Msk;
            }
#endif
            Cy_I3C_WriteIntoDeviceAddressTable(base, idx, value);

            if (0UL != i2c)
            {
                /* I2C Device */
                SetAddrslotStatus(staticAddress, CY_I3C_ADDR_SLOT_I2C_DEV, context);
                i2cDevice.lvr = dcr;
                i2cDevice.staticAddress = staticAddress;

                Cy_I3C_UpdateI2CDevInList(&i2cDevice, idx, context);

                (i3cController->freePos) = ~(CY_I3C_BIT(idx));
                (i3cController->devCount)++;
                (i3cController->i2cDeviceCount)++;
            }
            else
            {
                /* I3C Device */
                SetAddrslotStatus(dynamicAddress, CY_I3C_ADDR_SLOT_I3C_DEV, context);

                i3cDevice.bcr = bcr;
                i3cDevice.dcr = dcr;
                i3cDevice.dynamicAddress = dynamicAddress;
                i3cDevice.staticAddress = staticAddress;

                (void)RetrieveI3CDeviceInfo(base, &i3cDevice, false, context);
                Cy_I3C_UpdateI3CDevInList(&i3cDevice, idx, context);

                i3cController->freePos &= ~(CY_I3C_BIT(idx));
                (i3cController->devCount)++;
            }
        }
    }

    else
    {

        context->i3cMode = CY_I3C_SECONDARY_CONTROLLER;

        I3C_CORE_TGT_EVENT_STATUS(base) &= (~I3C_CORE_TGT_EVENT_STATUS_HJ_EN_Msk);

        /* Sets the number of entries in the Receive FIFO that trigger the interrupt to 1 word */
        I3C_CORE_DATA_BUFFER_THLD_CTRL(base) &= _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, 5UL) |
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_STATUS_LEVEL_TX_BUF_EMPTY_LOC, 1UL);

        Cy_I3C_SetInterruptMask(base, CY_I3C_TGT_INTR_Msk | CY_I3C_INTR_DEFTGT_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_TGT_INTR_Msk | CY_I3C_INTR_DEFTGT_STS);
    }

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_I3C_TargetInterrupt
****************************************************************************//**
*
* This is the interrupt function for the I3C configured in target mode.
* This function should be called inside the user-defined interrupt service routine.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*******************************************************************************/
#if CY_IP_MXI3C_VERSION_MINOR == 1u || defined(CY_DOXYGEN)
void Cy_I3C_TargetInterrupt(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t intrCause;
    intrCause = Cy_I3C_GetInterruptStatus(base);

    if (0UL != (CY_I3C_INTR_IBI_UPDATED_STS & intrCause))
    {
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_IBI_UPDATED_STS);
        /* Handle the response */
        uint8_t res = (uint8_t)_FLD2VAL(I3C_CORE_TGT_IBI_RESP_IBI_STS, base->TGT_IBI_RESP);

        if (I3C_CORE_TGT_INTR_REQ_IBI_STS_IBI_NOT_ATTEMPTED == res)
        {
            /* IBI not attempted, if
            *  1. Controller has not assigned the dynamic address
            *  2. Controller has cleared the assigned dynamic address
            *  3. Controller has disabled the IBI (DISEC)
            *  4. The controller has switched to controller mode */
            if (NULL != (context->cbEvents))
            {
                context->cbEvents(CY_I3C_TARGET_IBI_NOT_ATTEMPTED_EVENT);
            }
        }
        else if (I3C_CORE_TGT_INTR_REQ_IBI_STS_IBI_EARLY_TERMINATE_BY_CONTROLLER == res)
        {
            /* For TIR with data, controller terminated before reading all the data. */
            if (NULL != (context->cbEvents))
            {
                context->cbEvents(CY_I3C_TARGET_IBI_EARLY_STOP_EVENT);
            }
        }
        else
        {
            /* IBI is acked */
            if (NULL != (context->cbEvents))
            {
                context->cbEvents(CY_I3C_TARGET_IBI_ACKNOWLEDGED_EVENT);
            }
        }
    }

    if (0UL != (CY_I3C_INTR_TX_BUFFER_THLD_STS & intrCause))
    {
        TargetHandleDataTransmit(base, context);
    }

    if (0UL != (CY_I3C_INTR_RX_BUFFER_THLD_STS & intrCause))
    {
        TargetHandleDataReceive(base, context);
    }

