PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    if (0UL != ((CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_DEFTGT_STS) & intrCause))
    {
        TargetRespReadyStsHandle(base, context);
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_RESP_READY_STS);
    }

    if (0UL != (CY_I3C_INTR_CCC_UPDATED_STS & intrCause))
    {
        if (0UL != (_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_MRL_UPDATED, I3C_CORE_TGT_EVENT_STATUS(base))))
        {
            if (NULL != (context->cbEvents))
            {
                context->cbEvents(CY_I3C_TARGET_MAX_RD_LEN_UPDT_EVENT);
            }
            I3C_CORE_TGT_EVENT_STATUS(base) |= I3C_CORE_TGT_EVENT_STATUS_MRL_UPDATED_Msk;
        }
        else if (0UL != (_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_MWL_UPDATED, I3C_CORE_TGT_EVENT_STATUS(base))))
        {
            if (NULL != (context->cbEvents))
            {
                context->cbEvents(CY_I3C_TARGET_MAX_WR_LEN_UPDT_EVENT);
            }
            I3C_CORE_TGT_EVENT_STATUS(base) |= I3C_CORE_TGT_EVENT_STATUS_MWL_UPDATED_Msk;
        }
        else
        {
            if (NULL != (context->cbEvents))
            {
                context->cbEvents(CY_I3C_TARGET_CCC_REG_UPDATED_EVENT);
            }
        }

        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_CCC_UPDATED_STS);
    }

    if (0UL != (CY_I3C_INTR_DYN_ADDR_ASSGN_STS & intrCause))
    {
        if (NULL != (context->cbEvents))
        {
            context->cbEvents(CY_I3C_TARGET_ASSIGNED_DYN_ADDR_EVENT);
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_DYN_ADDR_ASSGN_STS);
    }

    /* Read request from the controller */
    if (0UL != (CY_I3C_INTR_READ_REQ_RECV_STS & intrCause))
    {
        if (NULL != (context->cbEvents))
        {
            /* Callback - in case of error */
            uint32_t event;
            event = CY_I3C_TARGET_NO_VALID_CMD_IN_CMDQ_EVENT;
            if (0UL != (_FLD2VAL(I3C_CORE_CCC_DEVICE_STATUS_DATA_NOT_READY, I3C_CORE_CCC_DEVICE_STATUS(base))))
            {
                event |= CY_I3C_TARGET_DATA_NOT_READY_EVENT;
            }
            if (NULL != (context->cbEvents))
            {
                context->cbEvents(event);
            }
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
    }

    if (0UL != (CY_I3C_INTR_BUSOWNER_UPDATED_STS & intrCause))
    {
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_BUSOWNER_UPDATED_STS);
        Cy_I3C_Resume(base, context);
        (void)SecondaryControllerInit(base, true, context);
        if (NULL != (context->cbEvents))
        {
            context->cbEvents(CY_I3C_CONTROLLER_ROLE_UPDATED_EVENT);
        }
        return;
    }

    if (0UL != (CY_I3C_INTR_TGT_RST_PATTERN_DET_STS & intrCause))
    {
        if (NULL != (context->cbEvents))
        {
            context->cbEvents(CY_I3C_TARGET_RESET_EVENT);
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_TGT_RST_PATTERN_DET_STS);
    }
}
#endif

/*******************************************************************************
* Function Name: Cy_I3C_ControllerInterrupt
****************************************************************************//**
*
* This is the interrupt function for the I3C configured in controller mode.
* This function should be called inside the user-defined interrupt service routine.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_ControllerInterrupt(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t intrCause;
    cy_en_i3c_status_t retStatus = CY_I3C_CONTROLLER_NOT_READY;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;
    intrCause = Cy_I3C_GetInterruptStatus(base);

    if (0UL != (CY_I3C_INTR_RESP_READY_STS & intrCause))
    {
        if (0UL != (CY_I3C_INTR_TRANSFER_ERR_STS & intrCause))
        {
            uint32_t respCmdPort, errorEvent;
            respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
            errorEvent = ResponseErrorEvent(respCmdPort);
            context->controllerStatus |= CY_I3C_CONTROLLER_HALT_STATE;
            context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
            context->state = CY_I3C_IDLE;

            if (NULL != (context->cbEvents))
            {
                /* Callback - in case of error  */
                context->cbEvents(errorEvent);
            }
            Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_TRANSFER_ERR_STS);
            Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
            return;
        }

        else
        {
            ControllerRespReadyStsHandle(base, context);
        }

        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        return;
    }

    if (0UL != (CY_I3C_INTR_TRANSFER_ABORT_STS & intrCause))
    {
        context->controllerStatus |= CY_I3C_CONTROLLER_XFER_ABORTED | CY_I3C_CONTROLLER_HALT_STATE;
        context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
        context->state = CY_I3C_IDLE;

        I3C_CORE_RESET_CTRL(base) = I3C_CORE_RESET_CTRL_CMD_QUEUE_RST_Msk | I3C_CORE_RESET_CTRL_RESP_QUEUE_RST_Msk | I3C_CORE_RESET_CTRL_TX_FIFO_RST_Msk | I3C_CORE_RESET_CTRL_RX_FIFO_RST_Msk;
        do
        {
            /* wait till the reset is completed */
            retStatus = I3C_Check_Timeout(&timeout);
        }
        while (retStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

        Cy_I3C_Resume(base, context);

        if (NULL != context->cbEvents)
        {
            context->cbEvents(CY_I3C_XFER_ABORTED_ERROR_EVENT);
        }

        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_TRANSFER_ABORT_STS);
        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

        return;
    }

    if (0UL != (CY_I3C_INTR_IBI_BUFFER_THLD_STS & intrCause))
    {
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

