PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
        ControllerHandleIBIInterrupt(base, context);

        return;
    }

    if (0UL != (CY_I3C_INTR_BUSOWNER_UPDATED_STS & intrCause))
    {
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_BUSOWNER_UPDATED_STS);
        Cy_I3C_Resume(base, context);
        if (NULL != (context->cbEvents))
        {
            context->cbEvents(CY_I3C_CONTROLLER_ROLE_UPDATED_EVENT);
        }
        return;
    }

}

/*******************************************************************************
* Function Name: Cy_I3C_DeepSleepCallback_After
****************************************************************************//**
*
* This function handles transition of I3C controller after wake up from
* deep sleep mode.
*
* \param callbackParams
* The pointer to the callback parameters structure
* \ref cy_stc_syspm_callback_params_t.
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
static cy_en_syspm_status_t Cy_I3C_DeepSleepCallback_After(cy_stc_syspm_callback_params_t *callbackParams)
{
    cy_en_syspm_status_t result = CY_SYSPM_FAIL;
    uint8_t index, dynamicAddress, staticAddress, parity;
    uint32_t value;
    I3C_CORE_Type *locBase = (I3C_CORE_Type *) callbackParams->base;
    cy_stc_i3c_context_t *locContext = (cy_stc_i3c_context_t *) callbackParams->context;
    cy_stc_i3c_config_t *locConfig = &locContext->dsConfig;

    switch (locContext->i3cMode)
    {
    case CY_I3C_CONTROLLER:

        /* Setting the device operation mode to Controller - 0U */
        I3C_CORE_DEVICE_CTRL_EXTENDED(locBase) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_CONTROLLER);

        if (!locConfig->manualDataRate)
        {
            (void)Cy_I3C_SetDataRate(locBase, locContext->i3cSclRate, locContext->i3cClockHz, locContext);
        }
        else
        {
            I3C_CORE_SCL_I3C_OD_TIMING(locBase) = _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_HCNT, locConfig->openDrainHighCnt) |
                                                  _VAL2FLD(I3C_CORE_SCL_I3C_OD_TIMING_I3C_OD_LCNT, locConfig->openDrainLowCnt);
            I3C_CORE_SCL_I3C_PP_TIMING(locBase) = _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_HCNT, locConfig->pushPullHighCnt) |
                                                  _VAL2FLD(I3C_CORE_SCL_I3C_PP_TIMING_I3C_PP_LCNT, locConfig->pushPullLowCnt);
            I3C_CORE_SCL_I2C_FM_TIMING(locBase) = _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_HCNT, locConfig->i2cFMHighCnt) |
                                                  _VAL2FLD(I3C_CORE_SCL_I2C_FM_TIMING_I2C_FM_LCNT, locConfig->i2cFMLowCnt);
            I3C_CORE_SCL_I2C_FMP_TIMING(locBase) = _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_HCNT, locConfig->i2cFMPlusHighCnt) |
                                                   _VAL2FLD(I3C_CORE_SCL_I2C_FMP_TIMING_I2C_FMP_LCNT, locConfig->i2cFMPlusLowCnt);
            I3C_CORE_SCL_EXT_LCNT_TIMING(locBase) = _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_1, locConfig->extLowCnt1) |
                                                    _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_2, locConfig->extLowCnt2) |
                                                    _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_3, locConfig->extLowCnt3) |
                                                    _VAL2FLD(I3C_CORE_SCL_EXT_LCNT_TIMING_I3C_EXT_LCNT_4, locConfig->extLowCnt4);
            I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING(locBase) = _VAL2FLD(I3C_CORE_SCL_EXT_TERMN_LCNT_TIMING_I3C_EXT_TERMN_LCNT, locConfig->extTerminationLowCnt);
        }

        I3C_CORE_DEVICE_CTRL(locBase) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_IBA_INCLUDE, locConfig->ibaInclude ? 1UL : 0UL) |
                                        _VAL2FLD(I3C_CORE_DEVICE_CTRL_HOT_JOIN_CTRL, locConfig->hotJoinCtrl ? 1UL : 0UL);

        I3C_CORE_DEVICE_ADDR(locBase) = _VAL2FLD(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, locConfig->dynamicAddr) |
                                        I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID_Msk;

        I3C_CORE_BUS_FREE_AVAIL_TIMING(locBase) |= _VAL2FLD(I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_FREE_TIME, locConfig->busFreeTime);

        I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING(locBase) = _VAL2FLD(I3C_CORE_SDA_HOLD_SWITCH_DLY_TIMING_SDA_TX_HOLD, locConfig->sdaHoldTime);

        I3C_CORE_QUEUE_THLD_CTRL(locBase) = _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD, locConfig->cmdQueueEmptyThld) |
                                            _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, locConfig->respQueueThld) |
                                            _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD, locConfig->ibiQueueThld);


#if CY_IP_MXI3C_VERSION_MINOR == 1u
        I3C_CORE_QUEUE_THLD_CTRL(locBase) |= _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_DATA_THLD, locConfig->ibiDataThld);
#endif
        I3C_CORE_DATA_BUFFER_THLD_CTRL(locBase) = _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, locConfig->rxBufThld) |
            _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD, locConfig->txEmptyBufThld) |
            _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_START_THLD, locConfig->rxBufStartThld) |
            _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_START_THLD, locConfig->txBufStartThld);

        /* populate the device address table as per available devices. */
        for (index = 0U; index < (locContext->i3cController.devCount); index++)
        {
            if (locContext->devList[index].i2c)
            {
                staticAddress = locContext->devList[index].i2cDevice.staticAddress;
                value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, staticAddress) | I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Msk;
            }
            else
            {
                dynamicAddress = locContext->devList[index].i3cDevice.dynamicAddress;
                staticAddress = locContext->devList[index].i3cDevice.staticAddress;
                parity = even_parity(dynamicAddress);
                dynamicAddress |= (parity << 7U);
                value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, dynamicAddress) | _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, staticAddress);
#if CY_IP_MXI3C_VERSION_MINOR == 1u
                if ((bool)(locContext->devList[index].i3cDevice.bcr & CY_I3C_CORE_BCR_IBI_PAYLOAD_Msk))
                {
                    value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_WITH_DATA_Msk;
                }
#endif
            }

            Cy_I3C_WriteIntoDeviceAddressTable(locBase, index, value);
        }

