PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
        result = CY_SYSPM_SUCCESS;

        break;

    case CY_I3C_SECONDARY_CONTROLLER:
    case CY_I3C_TARGET:
#if CY_IP_MXI3C_VERSION_MINOR == 1u
        /* Setting the device operation mode to Target - 1U */
        I3C_CORE_DEVICE_CTRL_EXTENDED(locBase) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_TARGET);

        /* On setting this ADAPTIVE_I2C_I3C bit, the controller generates hot-join request only when it is in/changes to I3C mode of operation. */
        I3C_CORE_DEVICE_CTRL(locBase) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_ADAPTIVE_I2C_I3C, locConfig->adaptiveI2CI3C ? 1UL : 0UL);
        if (0U != locConfig->staticAddress)
        {
            I3C_CORE_DEVICE_ADDR(locBase) |= _VAL2FLD(I3C_CORE_DEVICE_ADDR_STATIC_ADDR, locConfig->staticAddress) | I3C_CORE_DEVICE_ADDR_STATIC_ADDR_VALID_Msk;
        }

        I3C_CORE_DEVICE_ADDR(locBase) |= _VAL2FLD(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, locConfig->dynamicAddr) | I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID_Msk;
        I3C_CORE_TGT_PID_VALUE(locBase) = (uint32_t)locConfig->pid;
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Intentional typecast from "unsigned 64-bit int" to narrower essential type "unsigned 32-bit int"');
        I3C_CORE_TGT_MIPI_ID_VALUE(locBase) = (locConfig->pid) >> 32UL;
        I3C_CORE_TGT_CHAR_CTRL(locBase) |= _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_MAX_DATA_SPEED_LIMIT, locConfig->speedLimit) |
                                           _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_HDR_CAPABLE, locConfig->hdrCapable) |
                                           _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_DCR, locConfig->dcr) |
                                           _VAL2FLD(I3C_CORE_TGT_CHAR_CTRL_DEVICE_ROLE, locConfig->deviceRoleCap);

        I3C_CORE_TGT_EVENT_STATUS(locBase) &= (locConfig->hotjoinEnable) ? I3C_CORE_TGT_EVENT_STATUS_HJ_EN_Msk : (~I3C_CORE_TGT_EVENT_STATUS_HJ_EN_Msk);
        I3C_CORE_BUS_FREE_AVAIL_TIMING(locBase) |=  _VAL2FLD(I3C_CORE_BUS_FREE_AVAIL_TIMING_BUS_AVAILABLE_TIME, locConfig->busAvailTime);
        I3C_CORE_BUS_IDLE_TIMING(locBase) = _VAL2FLD(I3C_CORE_BUS_IDLE_TIMING_BUS_IDLE_TIME, locConfig->busIdleTime);

        I3C_CORE_QUEUE_THLD_CTRL(locBase) = _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD, locConfig->cmdQueueEmptyThld) |
                                            _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, locConfig->respQueueThld);

        I3C_CORE_DATA_BUFFER_THLD_CTRL(locBase) = _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, locConfig->rxBufThld) |
            _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD, locConfig->txEmptyBufThld) |
            _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_START_THLD, locConfig->rxBufStartThld) |
            _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_START_THLD, locConfig->txBufStartThld);

#endif
        result = CY_SYSPM_SUCCESS;
        break;

    default:
        result = CY_SYSPM_SUCCESS;
        break;
    }

    /* restore interrupt mask*/
    Cy_I3C_SetInterruptMask(locBase, locContext->intr_mask);
    Cy_I3C_SetInterruptStatusMask(locBase, locContext->intr_mask);
    if (locContext->Enabled)
    {
        Cy_I3C_Enable(locBase, locContext);
    }
    return result;

}
/*******************************************************************************
* Function Name: Cy_I3C_DeepSleepCallback
****************************************************************************//**
*
* This function handles transition of I3C controller into and out of
* deep sleep mode.
*
* \param callbackParams
* The pointer to the callback parameters structure
* \ref cy_stc_syspm_callback_params_t.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_I3C_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    I3C_CORE_Type *locBase = (I3C_CORE_Type *) callbackParams->base;
    cy_stc_i3c_context_t *locContext = (cy_stc_i3c_context_t *) callbackParams->context;
    cy_en_syspm_status_t retStatus = CY_SYSPM_FAIL;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        /* Check for cmd/rsp/ibi/Rx/Tx FIFO is empty and bus condition is idle*/
        if (false == Cy_I3C_IsBusBusy((I3C_CORE_Type const *)locBase) && (locContext->state == CY_I3C_IDLE))
        {
            /*save the intr mask and disable all intr*/
            locContext->intr_mask = Cy_I3C_GetInterruptMask(locBase);
            Cy_I3C_SetInterruptMask(locBase, 0UL);
            Cy_I3C_SetInterruptStatusMask(locBase, 0UL);
            locContext->dsConfig.dynamicAddr = (uint8_t)_FLD2VAL(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, I3C_CORE_DEVICE_ADDR(locBase));
            if (locContext->Enabled)
            {
                Cy_I3C_Disable(locBase, locContext);
                locContext->Enabled = true;
            }
            retStatus = CY_SYSPM_SUCCESS;
        }
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        /* enable IP */
        Cy_I3C_SetInterruptMask(locBase, locContext->intr_mask);
        Cy_I3C_SetInterruptStatusMask(locBase, locContext->intr_mask);
        if (locContext->Enabled)
        {
            Cy_I3C_Enable(locBase, locContext);
        }
        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    {
        /* Clear the interrupts*/
        Cy_I3C_ClearInterrupt(locBase, CY_I3C_INTR_MASK);
        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_AFTER_TRANSITION:
    {
        /* Apply all config, restore interrupts and enable IP */
        retStatus = Cy_I3C_DeepSleepCallback_After(callbackParams);
    }
    break;

    default:
        retStatus = CY_SYSPM_FAIL;
        break;
    }

    return (retStatus);
}

/*******************************************************************************
* Function Name: Cy_I3C_HibernateCallback
****************************************************************************//**
*
* This function handles transition of I3C controller into hibernate mode.
*
* \param callbackParams
* The pointer to the callback parameters structure
* \ref cy_stc_syspm_callback_params_t.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_I3C_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    CY_UNUSED_PARAMETER(callbackParams); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(mode); /* Suppress a compiler warning about unused variables */

    /* There is no retention of any REG, For hibernate all data
       needed should be managed by the user in backup domain retained memory*/

