PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    return CY_SYSPM_FAIL;
}

/*******************************************************************************
* Function Name: even_parity
****************************************************************************//**
*
* Finds the parity of the address.
*
* \param address
* 7-bit right justified address.
*
* \return
* The parity of the address.
* 0: odd number of one bits in the address
* 1: even number of one bits in the address.
*
*******************************************************************************/
static uint8_t even_parity(uint8_t address)
{
    address ^= address >> 4U;
    address &= 0xFU;

    return (uint8_t)((0x9669U >> address) & 1U);
}

/*******************************************************************************
* Function Name: ffsq
****************************************************************************//**
*
* Finds the position of the first set bit in the given value.
*
* \param value
* Input value.
*
* \return
* The position of the first set bit.
*
*******************************************************************************/
static uint32_t FirstSetBit(uint32_t value)
{
    uint32_t r = 1UL;

    if (!((bool)value))
    {
        return 0UL;
    }
    if (!((bool)(value & 0xFFFFUL)))
    {
        value >>= 16UL;
        r += 16UL;
    }
    if (!((bool)(value & 0xFFUL)))
    {
        value >>= 8UL;
        r += 8UL;
    }
    if (!((bool)(value & 0xFUL)))
    {
        value >>= 4UL;
        r += 4UL;
    }
    if (!((bool)(value & 3UL)))
    {
        value >>= 2UL;
        r += 2UL;
    }
    if (!((bool)(value & 1UL)))
    {
        r += 1UL;
    }
    return r;
}

/*******************************************************************************
*  Function Name: SetAddrslotStatus
****************************************************************************//**
*
* Marks the status of the address parameter as defined
* by \ref cy_en_i3c_addr_slot_status_t.
*
* \param address
* 7-bit right justified address.
*
* \param status
* The status to be assigned to the address.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_config_t allocated
* by the user. The structure is used during the I2C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void SetAddrslotStatus(uint8_t address, cy_en_i3c_addr_slot_status_t status, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    uint8_t bitPos = address * 2U;
    unsigned long *ptr;

    ptr = i3cController->addrslotsStatusArray + (bitPos / CY_I3C_BITS_PER_LONG);
    *ptr &= ~(CY_I3C_ADDR_SLOT_STATUS_MASK << (bitPos % CY_I3C_BITS_PER_LONG));
    *ptr |= (unsigned long)status << (bitPos % CY_I3C_BITS_PER_LONG);
}

/*******************************************************************************
*  Function Name: InitAddrslots
****************************************************************************//**
*
* Initializes the status \ref cy_en_i3c_addr_slot_status_t of the addresses.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_config_t allocated
* by the user. The structure is used during the I2C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void InitAddrslots(cy_stc_i3c_context_t *context)
{
    uint8_t index;

    /* Set all the addresses as free initially */
    for (index = 0U; index < ((CY_I3C_MAX_ADDR + 1U) * 2U) / CY_I3C_BITS_PER_LONG; index++)
    {
        SetAddrslotStatus(index, CY_I3C_ADDR_SLOT_FREE, context);
    }

    /* Assigning reserved status for addresses from 1-7 */
    for (index = 0U; index < 8U; index++)
    {
        SetAddrslotStatus(index, CY_I3C_ADDR_SLOT_RSVD, context);
    }

    /* Assigning reserved status for the broadcast */
    SetAddrslotStatus(CY_I3C_BROADCAST_ADDR, CY_I3C_ADDR_SLOT_RSVD, context);

    /* Assigning reserved status for the following broadcast addresses:
        0x7E, 0x7D, 0x7C, 0x7A, 0x7B, 0x78, 0x79 */
    for (index = 1U; index < 8U; index++)
    {
        SetAddrslotStatus((uint8_t)(CY_I3C_BROADCAST_ADDR ^ CY_I3C_BIT(index)), CY_I3C_ADDR_SLOT_RSVD, context);
    }

}

/*******************************************************************************
*  Function Name: DeInitAddrslots
****************************************************************************//**
*
* Sets the status of the addresses to free.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void DeInitAddrslots(cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    uint8_t index;
    /*  Sets status of all the addresses as free */
    for (index = 0U; index < (((CY_I3C_MAX_ADDR + 1U) * 2U) / CY_I3C_BITS_PER_LONG); index++)
    {
        i3cController->addrslotsStatusArray[index] = 0UL;
    }
}

/*******************************************************************************
*  Function Name: GetI2CDevAddrPos
****************************************************************************//**
*
* Obtains the position of the I2C device with the specified static address
* in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param staticAddress
* The static address of the I2C device.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Position of the I2C device in the DAT.
*
*******************************************************************************/
static uint32_t GetI2CDevAddrPos(I3C_CORE_Type *base, uint8_t staticAddress, cy_stc_i3c_context_t *context)
{
    uint8_t index;

    CY_UNUSED_PARAMETER(context);

    for (index = 0U; index < CY_I3C_MAX_DEVS; index++)
    {
        if (staticAddress == Cy_I3C_ReadStaticAddrFromDAT(base, index))
        {
            return (uint32_t)index;
        }
    }

    return (uint32_t)CY_I3C_BAD_PARAM;
}

