PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: GetI3CDevAddrPos
****************************************************************************//**
*
* Obtains the position of the I3C device with the specified dynamic address
* in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param dynamicAddress
* The dynamic address of the I3C device.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Position of the I3C device in the DAT.
*
*******************************************************************************/
static uint32_t GetI3CDevAddrPos(I3C_CORE_Type *base, uint8_t dynamicAddress, cy_stc_i3c_context_t *context)
{
    uint8_t index;

    CY_UNUSED_PARAMETER(context); /* Suppress a compiler warning about unused variables */

    for (index = 0U; index < CY_I3C_MAX_DEVS; index++)
    {
        uint32_t ret;
        ret = Cy_I3C_ReadDynAddrFromDAT(base, index);
        if (dynamicAddress == ret)
        {
            return (uint32_t)index;
        }
    }

    return (uint32_t)CY_I3C_BAD_PARAM;
}

/*******************************************************************************
*  Function Name: GetDATFreePos
****************************************************************************//**
*
* Obtains the position of free location in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allo * by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Position of the free location in the DAT.
*
*******************************************************************************/
static uint32_t GetDATFreePos(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t ret;
    ret = FirstSetBit(context->i3cController.freePos) - 1UL;
    CY_UNUSED_PARAMETER(base); /* Suppress a compiler warning about unused variables */

    return ret;
}

/*******************************************************************************
*  Function Name: GetAaddrslotStatus
****************************************************************************//**
*
* Obtains the status of the address parameter.
*
* \param address
* 7-bit right justified address.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_addr_slot_status_t.
*
*******************************************************************************/
static cy_en_i3c_addr_slot_status_t GetAaddrslotStatus(uint8_t address, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    uint8_t bitPos = address * 2U;
    uint32_t status;

    if (address > CY_I3C_MAX_ADDR)
    {
        return CY_I3C_ADDR_SLOT_RSVD;
    }

    status = (i3cController->addrslotsStatusArray[bitPos / CY_I3C_BITS_PER_LONG]);
    status >>= bitPos % CY_I3C_BITS_PER_LONG;

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to cy_en_i3c_addr_slot_status_t enum.');
    return (cy_en_i3c_addr_slot_status_t)(status & CY_I3C_ADDR_SLOT_STATUS_MASK);
}

/*******************************************************************************
*  Function Name: ResponseError
****************************************************************************//**
*
* Provides the error type received in the response status.
*
* \param respCmd
* The value read from the response queue port register
*
* \return
* \ref cy_en_i3c_status_t.

*******************************************************************************/
static cy_en_i3c_status_t ResponseError(uint32_t respCmd)
{
    uint8_t error;
    error = (uint8_t)(_FLD2VAL(I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS, respCmd));
    cy_en_i3c_status_t ret = (cy_en_i3c_status_t)0U;

    switch (error)
    {
    case 1U:
        ret = CY_I3C_CONTROLLER_CRC_ERROR;
        break;
    case 2U:
        ret = CY_I3C_CONTROLLER_PARITY_ERROR;
        break;
    case 3U:
        ret = CY_I3C_CONTROLLER_FRAME_ERROR;
        break;
    case 4U:
        ret = CY_I3C_CONTROLLER_BROADCAST_ADDR_NACK_ERROR;
        break;
    case 5U:
        ret = CY_I3C_CONTROLLER_ADDR_NACK_ERROR;
        break; //This is same as ERROR CE2
    case 6U:
        ret = CY_I3C_CONTROLLER_BUFFER_OVERFLOW_ERROR;
        break;
    case 8U:
        ret = CY_I3C_CONTROLLER_XFER_ABORTED_ERROR;
        break;
    case 9U:
        ret = CY_I3C_CONTROLLER_I2C_TGT_WDATA_NACK_ERROR;
        break;
    case 12U:
        ret = CY_I3C_CONTROLLER_PEC_ERROR;
        break;
    default: /* Unknown Error */
        break;
    }
    return ret;
}

/*******************************************************************************
*  Function Name: ResponseErrorEvent
****************************************************************************//**
*
* Provides error events to be passed by \ref cy_cb_i3c_handle_events_t callback
* based on the type of error type received in the response status.
*
* \param respCmd
* The value read from the response queue port register.
*
* \return
* \ref group_i3c_macros_callback_events.

******************************************************************************/
static uint32_t ResponseErrorEvent(uint32_t respCmd)
{
    uint32_t error;
    error = _FLD2VAL(I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS, respCmd);
    uint32_t ret = 0UL;

    switch (error)
    {
    case 1U:
        ret = CY_I3C_CRC_ERROR_EVENT;
        break;
    case 2U:
        ret = CY_I3C_PARITY_ERROR_EVENT;
        break;
    case 3U:
        ret = CY_I3C_FRAME_ERROR_EVENT;
        break;
    case 4U:
        ret = CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT;
        break;
    case 5U:
        ret = CY_I3C_ADDR_NACK_ERROR_EVENT;
        break;
    case 6U:
        ret = CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT;
        break;
    case 8U:
        ret = CY_I3C_XFER_ABORTED_ERROR_EVENT;
        break;
    case 9U:
        ret = CY_I3C_I2C_TGT_WDATA_NACK_ERROR_EVENT;
        break;
    case 10U:
        ret = CY_I3C_CONTROLLER_EARLY_TERMINATION_EVENT;
        break;
    case 12U:
        ret = CY_I3C_PEC_ERROR_EVENT;
        break;
    default: /* Unknown Error */
        break;

