PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    }
    return ret;
}

/*******************************************************************************
* Function Name: WriteArray
****************************************************************************//**
*
* Places an array of data in the transmit FIFO.
* This function does not block. It returns how many data elements were
* placed in the transmit FIFO.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to data to place in the transmit FIFO.
*
* \param size
* The number of data elements to transmit.
*
*******************************************************************************/
static void WriteArray(I3C_CORE_Type *base, void *buffer, uint32_t size)
{
    uint32_t *buf = buffer;
    uint32_t index;

    /*Put data in TX FIFO */
    for (index = 0UL; index < (size / 4UL); ++index)
    {
        Cy_I3C_WriteTxFIFO(base, *(buf + index));
    }

    if (0UL != (size & 3UL))
    {
        uint8_t cnt = (uint8_t)(size & 3UL);
        uint8_t *srcPtr, *destPtr;
        uint32_t value = 0UL;
        destPtr = (uint8_t *)(&value);
        srcPtr = (uint8_t *)(buf + index);

        for (index = 0UL; index < cnt; index++)
        {
            *destPtr = *srcPtr;
            destPtr++;
            srcPtr++;
        }
        Cy_I3C_WriteTxFIFO(base, value);
    }
}


/*******************************************************************************
* Function Name: ReadArray
****************************************************************************//**
*
* Reads an array of data out of the receive FIFO.
* This function does not block.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to location to place data read from receive FIFO.
*
* \param size
* The number of data bytes to read from the receive FIFO.
*
*******************************************************************************/
static void ReadArray(I3C_CORE_Type *base, void *buffer, uint32_t size)
{
    uint32_t index, buffer_index = 0UL;
    uint32_t value = 0UL;
    uint32_t wd_size = size / 4U, byte_size = size % 4U;

    if (((uintptr_t)buffer % (uintptr_t)4U) == 0UL)      /* checking for 4 byte alignment */
    {
        for (index = 0UL; index < wd_size; index++)
        {
            value = Cy_I3C_ReadRxFIFO(base);
            *((uint32_t *)buffer + buffer_index++) = value;
        }
        buffer_index *= 4UL;
    }
    else
    {
        for (index = 0UL; index < wd_size; index++)
        {
            value = Cy_I3C_ReadRxFIFO(base);
            *((uint8_t *)buffer + buffer_index++) = (uint8_t)(value & 0xFFU);
            *((uint8_t *)buffer + buffer_index++) = (uint8_t)(value >> 8U & 0xFFU);
            *((uint8_t *)buffer + buffer_index++) = (uint8_t)(value >> 16U & 0xFFU);
            *((uint8_t *)buffer + buffer_index++) = (uint8_t)(value >> 24U & 0xFFU);
        }
    }

    if (byte_size > 0UL)
    {
        value = Cy_I3C_ReadRxFIFO(base);
        for (index = 0UL; index < byte_size; index++)
        {
            *((uint8_t *)buffer + buffer_index++) = (uint8_t)(value & 0xFFU);
            value = value >> 8U;
        }
    }

}

/*******************************************************************************
* Function Name: ControllerHandleDataTransmit
****************************************************************************//**
*
* Loads TX FIFO with data provided by \ref Cy_I3C_ControllerWrite.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void ControllerHandleDataTransmit(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if (context->controllerBufferSize > 1UL)
    {
        /* Get the number of bytes to copy into TX FIFO */
        uint32_t numToCopy = context->controllerBufferSize;

        /* Write data into TX FIFO */
        WriteArray(base, context->controllerBuffer, numToCopy);
    }
}

/*******************************************************************************
* Function Name: ControllerHandleDataReceive
****************************************************************************//**
*
* Reads data from RX FIFO into the buffer provided by \ref Cy_I3C_ControllerRead.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void ControllerHandleDataReceive(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t numToRead;
    numToRead = context->controllerBufferSize;
    /* Read from the RX FIFO */
    ReadArray(base, context->controllerBuffer, numToRead);
}


/*******************************************************************************
*  Function Name: RetrieveI3CDeviceInfo
****************************************************************************//**
*
* To retrieve device information which includes: max write len, max read len,
* max data speed, HDR capability, BCR, DCR and PID.
*
* \param base
* The pointer to the I3C instance.
*
* \param i3cDevice
* The pointer to the I3C device description structure \ref cy_stc_i3c_device_t.
*
* \param basicInfo
* true: obtains BCR, DCR and PID of the device
* false: otherwise
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t RetrieveI3CDeviceInfo(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, bool basicInfo, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_ccc_cmd_t cccCmd = {0};
    cy_stc_i3c_ccc_payload_t payload;
    cccCmd.address = i3cDevice->dynamicAddress;
    cccCmd.data = &payload;
    cy_en_i3c_status_t retStatus;

    if (true == basicInfo)
    {
        cy_stc_i3c_ccc_getbcr_t bcr = {0};
        cccCmd.data->data = &bcr;
        cccCmd.cmd = CY_I3C_CCC_GETBCR;
        retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        if (CY_I3C_SUCCESS != retStatus)
        {
            return retStatus;
        }
        i3cDevice->bcr = bcr.bcr;

        cy_stc_i3c_ccc_getdcr_t dcr = {0};
        cccCmd.data->data = &dcr;
        cccCmd.cmd = CY_I3C_CCC_GETDCR;
        retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        if (CY_I3C_SUCCESS != retStatus)
        {
            return retStatus;
        }
        i3cDevice->dcr = dcr.dcr;

        cy_stc_i3c_ccc_getpid_t pid = {0};
        cccCmd.data->data = &pid;
        cccCmd.cmd = CY_I3C_CCC_GETPID;
        retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        if (CY_I3C_SUCCESS != retStatus)
        {
            return retStatus;
        }
        uint8_t *ptr;
        uint8_t cnt;
        uint32_t shift;
        ptr = pid.pid;
        i3cDevice->provisonalID = 0UL;

        for (cnt = 0U; cnt < sizeof(pid); cnt++)
        {
            shift = (sizeof(pid) - cnt - 1U) * 8U;
            (i3cDevice->provisonalID) |= ((uint64_t)(*ptr)) << shift;
            ptr++;
        }
    }

    /* Get max read len */
    cy_stc_i3c_ccc_mrwl_t mrwl = {0};
    cccCmd.data->data = &mrwl;
    cccCmd.cmd = CY_I3C_CCC_GETMRL;
    retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }
    i3cDevice->mrl = mrwl.len;
    i3cDevice->ibipayloadSize = mrwl.payloadSize;

    /* Get max write len */
    cccCmd.cmd = CY_I3C_CCC_GETMWL;
    retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }
    i3cDevice->mwl = mrwl.len;

    /*Get Asynchronous timing mode 0 support*/
    cccCmd.cmd = CY_I3C_CCC_GETXTIME;
    cy_stc_i3c_ccc_getxtime_t getxtime_data;
    cccCmd.data->data = &getxtime_data;
    retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
    if (CY_I3C_SUCCESS != retStatus)
    {
        Cy_I3C_Resume(base, context);
    }
    else
    {
        i3cDevice->ATM0Supported = (bool)(getxtime_data.supportedModes & CY_I3C_BIT(1));
    }

    if (0U != (CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk & (i3cDevice->bcr)))
    {
        cy_stc_i3c_ccc_getmxds_t mxds = {0};
        i3cDevice->speedLimit = true;
        cccCmd.data->data = &mxds;
        cccCmd.cmd = CY_I3C_CCC_GETMXDS;
        retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        if (CY_I3C_SUCCESS != retStatus)
        {
            return retStatus;
        }
        i3cDevice->maxReadDs = mxds.maxrd;
        i3cDevice->maxWriteDs = mxds.maxwr;
        i3cDevice->maxReadTurnaround[0] = mxds.maxrdturn[0];
        i3cDevice->maxReadTurnaround[1] = mxds.maxrdturn[1];
        i3cDevice->maxReadTurnaround[2] = mxds.maxrdturn[2];
    }

    else
    {
        i3cDevice->speedLimit = false;
    }

    if (0U != (CY_I3C_CORE_BCR_HDR_CAP_Msk & (i3cDevice->bcr)))
    {
        cy_stc_i3c_ccc_gethdrcap_t hdrcap = {0};
        i3cDevice->hdrSupport = true;
        cccCmd.data->data = &hdrcap;
        cccCmd.cmd = CY_I3C_CCC_GETHDRCAP;
        retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        if (CY_I3C_SUCCESS != retStatus)
        {
            return retStatus;
        }
        i3cDevice->HDRCap = hdrcap.modes;

        if ((hdrcap.getcapByte2 & 0xC0U) != 0U)   //checking if target supports HDR flow control
        {
            cccCmd.cmd = CY_I3C_CCC_ENDXFER(false);
            cccCmd.dbp = true;
            cccCmd.db = 0xf7U;
            uint8_t data = 0xF0U;          //disable HDR flow control
            cccCmd.data->data = &data;
            cccCmd.data->len = 1U;
            retStatus = Cy_I3C_SendCCCCmd(base, &cccCmd, context);
            if (CY_I3C_SUCCESS != retStatus)
            {
                return retStatus;
            }
        }
    }

    else
    {
        i3cDevice->hdrSupport = false;
    }
    return retStatus;
}

