PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    /* Direct command, get the address offset in the DAT */
    pos = GetI3CDevAddrPos(base, cccCmd->address, context);

    /* DATA_LENGTH field indicates the expected number of bytes from the Target.
        DATA_LENGTH should be provided by the calling API and not the user */

    cmd.cmdHigh = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                  _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, dataLen);

    cmd.cmdLow = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Msk |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD, cccCmd->cmd) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;

    if (cccCmd->dbp)
    {
        cmd.cmdHigh |= _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DB, cccCmd->db);
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DBP_Msk;
    }
    if (context->devList[(uint8_t)pos].i3cDevice.PECEnabled)
    {
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk;
    }

    /* Disable the interrupt signals by clearing the bits */
    Cy_I3C_SetInterruptMask(base, 0UL);
    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh ;
    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow ;
}

/*******************************************************************************
*  Function Name: enec_disec_ccc
****************************************************************************//**
*
* Enable/Disable Target Events Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t enec_disec_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;

    retStatus = CCCTargetAddressValidation(cccCmd->address, false, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 1 byte of data */
    if (0U == cccCmd->data->len)
    {
        return CY_I3C_BAD_PARAM;
    }

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    return retStatus;
}

/*******************************************************************************
*  Function Name: rstdaa_ccc
****************************************************************************//**
*
* Reset Dynamic Address Assignment Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t rstdaa_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t pos = 0UL;
    uint32_t devCount;

    retStatus = CCCTargetAddressValidation(cccCmd->address, false, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    CCC_Set(base, cccCmd, context);

    /* Handling of unicast command */
    if (CY_I3C_BROADCAST_ADDR != cccCmd->address)
    {
        retStatus = ControllerHandleCCCResponse(base, NULL, context);
        if (CY_I3C_SUCCESS != retStatus)
        {
            return retStatus;
        }
        pos = GetI3CDevAddrPos(base, cccCmd->address, context);

        Cy_I3C_WriteIntoDeviceAddressTable(base, (uint8_t)pos, 0UL);

        context->i3cController.freePos |= CY_I3C_BIT(pos);
        context->i3cController.devCount--;

        SetAddrslotStatus(cccCmd->address, CY_I3C_ADDR_SLOT_FREE, context);
    }

    /* Handling of broadcast command */
    else
    {
        retStatus = ControllerHandleCCCResponse(base, NULL, context);
        if (CY_I3C_SUCCESS != retStatus)
        {
            return retStatus;
        }
        devCount = context->i3cController.devCount;
        for (pos = 0UL; pos < devCount; pos++)
        {
            Cy_I3C_WriteIntoDeviceAddressTable(base, (uint8_t)pos, 0UL);

            context->i3cController.freePos |= CY_I3C_BIT(pos);
            context->i3cController.devCount--;
            context->i3cController.dynAddrDevCount--;
        }

        context->i3cController.lastAddress = 0U;
        DeInitAddrslots(context);
        InitAddrslots(context);
        SetAddrslotStatus(context->dsConfig.dynamicAddr, CY_I3C_ADDR_SLOT_I3C_DEV, context);

    }

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: setmrwl_ccc
****************************************************************************//**
*
* Set Maximum Read/Write Length Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t setmrwl_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint8_t pos;
    uint8_t idx;
    cy_en_i3c_status_t retStatus;
    uint16_t *data;

    retStatus = CCCTargetAddressValidation(cccCmd->address, false, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 2 byte of data */
    if (0U == cccCmd->data->len)
    {
        return CY_I3C_BAD_PARAM;
    }

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, NULL, context);

