PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Set maximum read length for the target device */
    if (CY_I3C_CCC_SETMRL(false) == cccCmd->cmd)
    {
        pos = (uint8_t)(GetI3CDevAddrPos(base, cccCmd->address, context));
        data = (uint16_t *)(cccCmd->data->data);
        context->devList[pos].i3cDevice.mrl = *data;
    }

    /* Set maximum write length for the target device */
    else if (CY_I3C_CCC_SETMWL(false) == cccCmd->cmd)
    {
        pos = (uint8_t)(GetI3CDevAddrPos(base, cccCmd->address, context));
        data = (uint16_t *)(cccCmd->data->data);
        context->devList[pos].i3cDevice.mwl = *data;
    }

    /* Set maximum read length for all the target I3C devices - broadcast command */
    else if (CY_I3C_CCC_SETMRL(true) == cccCmd->cmd)
    {
        cy_stc_i3c_controller_devlist_t *devList = context->devList;
        for (idx = 0U; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
        {
            if (!devList->i2c)
            {
                data = (uint16_t *)(cccCmd->data->data);
                devList->i3cDevice.mrl = *data;
            }
            devList++;
        }
    }

    /* Set maximum write length for all the target I3C devices - broadcast command */
    else
    {
        cy_stc_i3c_controller_devlist_t *devList = context->devList;
        for (idx = 0U; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
        {
            if (!devList->i2c)
            {
                data = (uint16_t *)(cccCmd->data->data);
                devList->i3cDevice.mwl = *data;
            }
            devList++;
        }
    }

    context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
    return CY_I3C_SUCCESS;

}


/*******************************************************************************
*  Function Name: setxtime_ccc
****************************************************************************//**
*
* Prepares and sends commands into the command queue for SETXTIME CCC.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
#if CY_IP_MXI3C_VERSION_MINOR == 1u
static cy_en_i3c_status_t setxtime_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t value;
    uint8_t pos, idx;

    retStatus = CCCTargetAddressValidation(cccCmd->address, false, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 1 byte of data */
    if (0U == cccCmd->data->len)
    {
        return CY_I3C_BAD_PARAM;
    }

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    if (*(uint8_t *)(cccCmd->data->data) == CY_I3C_ENTER_ASYNC_MODE0)
    {

        I3C->TIMING_CNT_CTRL |= I3C_TIMING_CNT_CTRL_CNT_ENABLE_Msk;

        if (0U != (cccCmd->cmd & CY_I3C_CCC_DIRECT))   //Directed ccc
        {
            pos = GetI3CDevAddrPos(base, cccCmd->address, context);
            value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
            value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_TS_Msk;
            Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

        }
        else                                //Broadcast mode ccc
        {
            cy_stc_i3c_controller_devlist_t *devList = context->devList;
            for (idx = 0U; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
            {
                if (!devList->i2c && devList->i3cDevice.ATM0Supported)
                {
                    pos = GetI3CDevAddrPos(base, devList->i3cDevice.dynamicAddress, context);
                    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
                    value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_TS_Msk;
                    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);
                }
                devList++;
            }
        }
    }
    if (*(uint8_t *)(cccCmd->data->data) == CY_I3C_EXIT_ASYNC_MODES)
    {
        if (0U != (cccCmd->cmd & CY_I3C_CCC_DIRECT))     //Directed ccc
        {
            pos = GetI3CDevAddrPos(base, cccCmd->address, context);
            value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
            value &= ~I3C_CORE_DEV_ADDR_TABLE_LOC1_TS_Msk;
            Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

        }
        else                                 //Broadcast mode ccc
        {
            cy_stc_i3c_controller_devlist_t *devList = context->devList;
            for (idx = 0U; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
            {
                if (!devList->i2c)
                {
                    pos = GetI3CDevAddrPos(base, devList->i3cDevice.dynamicAddress, context);
                    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
                    value &= ~I3C_CORE_DEV_ADDR_TABLE_LOC1_TS_Msk;
                    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);
                }
                devList++;
            }
        }
    }

    return retStatus;
}

/*******************************************************************************
*  Function Name: getxtime_ccc
****************************************************************************//**
*
* Prepares and sends commands into the command queue for GETXTIME CCC.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static cy_en_i3c_status_t getxtime_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0UL;
    uint32_t data;
    cy_stc_i3c_ccc_getxtime_t *getxtime_data;

    retStatus = CCCTargetAddressValidation(cccCmd->address, true, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 4 bytes of data */
    cccCmd->data->len = ((uint16_t)sizeof(*getxtime_data));

    CCC_Get(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);

