PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Read data from the FIFO to the data_field of the cmd structure */
    data = Cy_I3C_ReadRxFIFO(base);

    getxtime_data = (cy_stc_i3c_ccc_getxtime_t *)cccCmd->data->data;
    getxtime_data->supportedModes = data & 0xFF;
    getxtime_data->state = data >> 8U & 0xFF;
    getxtime_data->frequency = data >> 16U & 0xFF;
    getxtime_data->inaccuracy = data >> 24U & 0xFF;

    return CY_I3C_SUCCESS;
}
#endif
/*******************************************************************************
*  Function Name: setda_ccc
****************************************************************************//**
*
* Prepares and sends commands into the command queue for SETDASA and SETNEWDA CCCs.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void setda_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint8_t pos;
    uint8_t *data;
    uint32_t value;
    data = (uint8_t *)cccCmd->data->data;

    value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, *data) |
            _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, cccCmd->address);

    pos = (uint8_t)(GetDATFreePos(base, context));
    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

    /* Disable the interrupt signals by clearing the bits */
    Cy_I3C_SetInterruptMask(base, 0UL);
    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

    I3C_CORE_COMMAND_QUEUE_PORT(base) = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_ADDR_ASSGN_CMD |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_CMD, cccCmd->cmd) |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_INDX, pos) |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_COUNT, 1U) |
                                        I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_ROC_Msk |
                                        I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TOC_Msk;

}

/*******************************************************************************
*  Function Name: setnewda_ccc
****************************************************************************//**
*
* Set New Dynamic Address Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t setnewda_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint32_t  value;
    cy_en_i3c_status_t retStatus;
    uint8_t *data;
    uint8_t parity, pos;

    /* Expects 1 byte of data */
    if (0U == cccCmd->data->len)
    {
        return CY_I3C_BAD_PARAM;
    }

    data = (uint8_t *)cccCmd->data->data;

    (*data) = (*data << 1U);

    cccCmd->data->data = data;

    context->controllerStatus |= CY_I3C_CONTROLLER_DIRECTED_CCC_WR_XFER;

    CCC_Set(base, cccCmd, context);

    (*data) = (*data >> 1U);

    /* Handling the response */
    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    pos = (uint8_t)(GetI3CDevAddrPos(base, cccCmd->address, context));

    SetAddrslotStatus(*data, CY_I3C_ADDR_SLOT_I3C_DEV, context);

    context->devList[pos].i3cDevice.dynamicAddress = *data; /* Updating the local list */

    parity = even_parity(*data);

    (*data) |= (parity << 7U);


    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);

    value &= ~I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR_Msk;
    value |= _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, *data);

    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value); /* Updating the Device Address Table */

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: entas_ccc
****************************************************************************//**
*
* Enter Activity State Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t entas_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;

    retStatus = CCCTargetAddressValidation(cccCmd->address, false, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

    Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
    Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

