PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    return retStatus;
}

/*******************************************************************************
*  Function Name: enthdr0_ccc
****************************************************************************//**
*
* Enter HDR0 Mode Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t enthdr0_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;

    if (CY_I3C_BROADCAST_ADDR != cccCmd->address)
    {
        return CY_I3C_BAD_PARAM;
    }

    cccCmd->data->len = 0U;

    context->controllerStatus |= CY_I3C_CONTROLLER_BROADCAST_CCC_WR_XFER;

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getmrwl_ccc
****************************************************************************//**
*
* Get Maximum Read/Write Length Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getmrwl_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t data, respCmdPort = 0UL;
    uint16_t length;
    cy_stc_i3c_ccc_mrwl_t *mrwl;

    retStatus = CCCTargetAddressValidation(cccCmd->address, true, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 2 bytes of data */
    cccCmd->data->len = ((uint16_t)sizeof(*mrwl));

    CCC_Get(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* if(sizeof(*mrwl) != (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk))
        return CY_I3C_CONTROLLER_ERROR_CE0; //ERROR_CE0 - Illegally formatted CCC */

    /* Read data from the FIFO to the data_field of the cmd structure */
    data = (Cy_I3C_ReadRxFIFO(base));
    length = (uint16_t)data;
    length = CY_I3C_SWAP16(length); /* MSB byte will be returned first and then LSB */

    mrwl = (cy_stc_i3c_ccc_mrwl_t *)cccCmd->data->data;
    mrwl->len = length;
    mrwl->payloadSize = (uint8_t)(data >> CY_I3C_GETMRL_PAYLOAD_SIZE);

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getpid_ccc
****************************************************************************//**
*
* Get Provisional ID Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getpid_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint8_t index;
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0UL;
    uint8_t data[6U] = {0};
    cy_stc_i3c_ccc_getpid_t *getpid;

    retStatus = CCCTargetAddressValidation(cccCmd->address, true, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }
    /* Expects 2 bytes of data */
    cccCmd->data->len = (uint16_t)(sizeof(*getpid));

    CCC_Get(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /*if(sizeof(*getpid) != (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk))
        return CY_I3C_CONTROLLER_ERROR_CE0; //ERROR_CE0 - Illegally formatted CCC */

    /* Read data from the FIFO to the data_field of the cmd structure */
    ReadArray(base, data, sizeof(*getpid));
    getpid = (cy_stc_i3c_ccc_getpid_t *)cccCmd->data->data;

    for (index = 0U; index < sizeof(*getpid); index++)
    {
        getpid->pid[index] = data[index];/* MSB byte will be received first */
    }

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getbcr_ccc
****************************************************************************//**
*
* Get Bus Characteristic Register Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getbcr_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0UL;
    uint8_t data;
    cy_stc_i3c_ccc_getbcr_t *getbcr;

    retStatus = CCCTargetAddressValidation(cccCmd->address, true, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }
    /* Expects 1 byte of data */
    cccCmd->data->len = (uint16_t)(sizeof(*getbcr));

    CCC_Get(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);

