PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
}

/*******************************************************************************
*  Function Name: gethdrcap_ccc
****************************************************************************//**
*
* Get HDR Capability Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t gethdrcap_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0UL;
    uint32_t data = 0U, recvDataLen = 0U;
    cy_stc_i3c_ccc_gethdrcap_t *gethdrcap;

    retStatus = CCCTargetAddressValidation(cccCmd->address, true, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 1 byte of data */
    cccCmd->data->len = (uint16_t)(sizeof(*gethdrcap));

    CCC_Get(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }
    recvDataLen = respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk;

    /* Read data from the FIFO to the data_field of the cmd structure */
    data = Cy_I3C_ReadRxFIFO(base);

    gethdrcap = (cy_stc_i3c_ccc_gethdrcap_t *)cccCmd->data->data;
    gethdrcap->modes = (uint8_t)(data & 0xFFU);

    if (recvDataLen >= 2UL)
    {
        gethdrcap->getcapByte2 = (uint8_t)((data >> 8U) & 0xFFU);
    }
    if (recvDataLen >= 3UL)
    {
        gethdrcap->getcapByte3 = (uint8_t)((data >> 16U) & 0xFFU);
    }
    if (recvDataLen == 4UL)
    {
        gethdrcap->getcapByte4 = (uint8_t)((data >> 24U) & 0xFFU);
    }

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getacccr_ccc
****************************************************************************//**
*
* Get Accept Controllership Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getacccr_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0UL;
    uint8_t data;
    cy_stc_i3c_ccc_getacccr_t *getacccr;

    retStatus = CCCTargetAddressValidation(cccCmd->address, true, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    cccCmd->data->len = (uint16_t)(sizeof(getacccr));

    CCC_Get(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    data = (uint8_t)(Cy_I3C_ReadRxFIFO(base));

    getacccr = (cy_stc_i3c_ccc_getacccr_t *)cccCmd->data->data;
    getacccr->newcontroller = data;

    return CY_I3C_SUCCESS;

}

/*******************************************************************************
*  Function Name: endxfer_ccc
****************************************************************************//**
*
* Data Transfer Ending Procedure Control CCC.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t endxfer_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;

    retStatus = CCCTargetAddressValidation(cccCmd->address, false, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 1 byte of data */
    if (1U != cccCmd->data->len)
    {
        return CY_I3C_BAD_PARAM;
    }

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, NULL, context);

    return retStatus;
}

/*******************************************************************************
*  Function Name: deftgts_ccc
****************************************************************************//**
*
* Define List of Targets Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t deftgts_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint8_t index;
    uint32_t respCmdPort = 0UL;
    cy_stc_i3c_controller_t *i3cController = &(context->i3cController);
    cy_stc_i3c_controller_devlist_t *devList = context->devList;
    cy_en_i3c_status_t retStatus;
    uint8_t i3cDevCnt;
    bool send = false;
    /* Stores the list to be sent - the targets list */
    cy_stc_i3c_ccc_deftgts_t deftgts;

    /* Check for the presence of any secondary controllers on the bus */
    i3cDevCnt = (uint8_t)(i3cController->devCount);

    for (index = 0U; index < (i3cDevCnt); index++)
    {
        if (!devList->i2c)
        {
            /* It is an i3c device */
            if ((devList->i3cDevice.bcr & CY_I3C_CORE_BCR_DEVICE_ROLE_Msk) == CY_I3C_CORE_BCR_I3C_CONTROLLER)
            {
                /* The device is secondary controller capable
                Secondary Controller will also have CONTROLLER value in this field */
                send = true;
            }
        }
        devList++;
    }

    if (!send)
    {
        return CY_I3C_NO_SECONDARY_CONTROLLER_DEVICES;
    }

