PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    context->controllerStatus |= CY_I3C_CONTROLLER_BROADCAST_CCC_WR_XFER;

    /* create the list of devices */
    devList = context->devList;
    for (index = 0U; index < (i3cController->devCount); index++)
    {
        if (devList->i2c)
        {
            /* i2c device */
            deftgts.targets[index].staticAddress = (devList->i2cDevice.staticAddress) << 1U;
            deftgts.targets[index].dynAddress = 0U;
            deftgts.targets[index].lvr = devList->i2cDevice.lvr;
            deftgts.targets[index].bcr = 0U;
        }
        else
        {
            /* i3c device */
            deftgts.targets[index].staticAddress = (devList->i3cDevice.staticAddress) << 1;
            deftgts.targets[index].dynAddress = (devList->i3cDevice.dynamicAddress) << 1;
            deftgts.targets[index].dcr = devList->i3cDevice.dcr;
            deftgts.targets[index].bcr = devList->i3cDevice.bcr;
        }
        devList++;
    }

    deftgts.controller.staticAddress = (uint8_t) _FLD2VAL(I3C_CORE_DEVICE_ADDR_STATIC_ADDR, I3C_CORE_DEVICE_ADDR(base)) << 1;
    deftgts.controller.dynAddress = (uint8_t)_FLD2VAL(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, I3C_CORE_DEVICE_ADDR(base)) << 1;
    deftgts.controller.bcr = 0x00U;
    deftgts.controller.dcr = 0x00U;
    deftgts.count = (uint8_t)(i3cController->devCount) + 1U;

    cccCmd->data->data = &(deftgts);
    cccCmd->data->len = (uint16_t)(deftgts.count * sizeof(cy_stc_i3c_ccc_dev_desc_t) + 1U);   /* 4 bytes per device + 1 device count byte */

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);

    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    return CY_I3C_SUCCESS;

}


/*******************************************************************************
*  Function Name: rstact_ccc
****************************************************************************//**
*
* Define List of Targets Command.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
* \note
* Application must make sure to re-apply any specific configurations or
* limitation to the Target after the reset, Since we do not support Flow
* control application should disable it with a CCC.
*
*******************************************************************************/
static cy_en_i3c_status_t rstact_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0UL;
    uint32_t pos = 0UL;   /* pos = 0 in case of broadcast command. */
    cy_stc_i3c_ccc_rstact_t *rst;
    cy_stc_i3c_ccc_t cmd;
    uint16_t dataLen = cccCmd->data->len;

    retStatus = CCCTargetAddressValidation(cccCmd->address, true, context);
    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Check if the cmd is a Direct or broadcast command;
    If Direct command, get the address offset in the DAT */
    if (cccCmd->cmd == CY_I3C_CCC_RSTACT(false))
    {
        pos = GetI3CDevAddrPos(base, cccCmd->address, context);
    }

    cmd.cmdHigh = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                  _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DB, cccCmd->db) |
                  _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, dataLen);

    cmd.cmdLow = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Msk |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD, cccCmd->cmd) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DBP_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;

    if (context->devList[(uint8_t)pos].i3cDevice.PECEnabled)
    {
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk;
    }

    if (cccCmd->cmd == CY_I3C_CCC_RSTACT(true))
    {
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk;
    }

    if (cccCmd->db < 0x04U)
    {
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TGT_RST_Msk;
    }
    else
    {
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk;
    }


    /* Disable the interrupt signals by clearing the bits */
    Cy_I3C_SetInterruptMask(base, 0UL);
    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh ;
    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow ;

    retStatus = ControllerHandleCCCResponse(base, &respCmdPort, context);
    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    if (cccCmd->db > 0x80U)
    {
        /* Expects 1 bytes of data */
        cccCmd->data->len = ((uint16_t)sizeof(*rst));
        rst = (cy_stc_i3c_ccc_rstact_t *)cccCmd->data->data;
        rst->resetTime = (uint8_t)(Cy_I3C_ReadRxFIFO(base));
    }

    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: devctrl_ccc
****************************************************************************//**
*
* Device control command to enable and disable Packet Error Check.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t devctrl_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint32_t value = 0UL;
    uint8_t pos, idx, dataBuf[6];
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ccc_devctrl_t data = *(cy_stc_i3c_ccc_devctrl_t *)(cccCmd->data->data);
    cy_stc_i3c_controller_devlist_t *devList = context->devList;
    bool isPECEnabled = (bool)(data.payloadByte0 & CY_I3C_BIT(7));

    retStatus = CCCTargetAddressValidation(cccCmd->address, false, context);

    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

    /* Expects 6 byte of data */
    if (6U != cccCmd->data->len)
    {
        return CY_I3C_BAD_PARAM;
    }

    /* Put the data into the TX fifo */
    dataBuf[0] = ((((uint8_t)data.addrMask << 5U | (uint8_t)data.startOffset << 3U) | (uint8_t)data.PEC_BL << 1U) | (uint8_t)data.regMod);
    dataBuf[1] = data.devID << 1U;
    dataBuf[2] = data.payloadByte0;
    dataBuf[3] = data.payloadByte1;
    dataBuf[4] = data.payloadByte2;
    dataBuf[5] = data.payloadByte3;
    cccCmd->data->data = dataBuf;

    CCC_Set(base, cccCmd, context);

    retStatus = ControllerHandleCCCResponse(base, NULL, context);

