PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    if (CY_I3C_SUCCESS != retStatus)
    {
        return retStatus;
    }

    if (data.addrMask == BROADCAST_CMD)               /* broadcast condition */
    {
        for (idx = 0U; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
        {
            if (!devList->i2c)
            {
                devList->i3cDevice.PECEnabled = isPECEnabled;          /* setting PEC in context i3cdevice */
                pos = (uint8_t)GetI3CDevAddrPos(base, devList->i3cDevice.dynamicAddress, context);
                value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
#if CY_IP_MXI3C_VERSION_MINOR == 1u
                if (isPECEnabled)                                    /* setting PEC enabled in DAT */
                {
                    value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Msk;
                }
                else
                {
                    value &= ~I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Msk;
                }
#endif
                Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);
            }
            devList++;
        }
    }
    else if (data.addrMask == MULTICAST_CMD)            /* multicast condition*/
    {
        for (idx = 0U; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
        {
            if (!devList->i2c && ((data.devID & CY_I3C_GENMASK(6U, 3U)) & devList->i3cDevice.dynamicAddress) == (data.devID & CY_I3C_GENMASK(6U, 3U)))
            {
                devList->i3cDevice.PECEnabled = isPECEnabled;          /* setting PEC in context i3cdevice*/
                pos = (uint8_t)GetI3CDevAddrPos(base, devList->i3cDevice.dynamicAddress, context);
                value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
#if CY_IP_MXI3C_VERSION_MINOR == 1u
                if (isPECEnabled)                                    /* setting PEC enabled in DAT*/
                {
                    value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Msk;
                }
                else
                {
                    value &= ~I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Msk;
                }
#endif
                Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);
            }
            devList++;
        }
    }
    else if (data.addrMask == UNICAST_CMD)            /*unicast condition*/
    {
        for (idx = 0U; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
        {
            if (!devList->i2c && (data.devID == devList->i3cDevice.dynamicAddress))
            {
                devList->i3cDevice.PECEnabled = isPECEnabled;          /*setting PEC in context i3cdevice*/
                pos = (uint8_t)GetI3CDevAddrPos(base, devList->i3cDevice.dynamicAddress, context);
                value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
#if CY_IP_MXI3C_VERSION_MINOR == 1u
                if (isPECEnabled)                                    /*setting PEC enabled in DAT*/
                {
                    value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Msk;
                }
                else
                {
                    value &= ~I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_PEC_EN_Msk;
                }
#endif
                Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);
                break;
            }
            devList++;
        }
    }
    else
    {
        retStatus = CY_I3C_BAD_PARAM;
    }

    return retStatus;
}
/*******************************************************************************
*  Function Name: ControllerHDRWrite
****************************************************************************//**
*
* Writes data provided in the HDR command structure \ref cy_stc_i3c_hdr_cmd_t
* to a specific device in HDR Mode.
*
* \param base
* The pointer to the I3C instance.
*
* \param hdrCmd
* The pointer to the I3C HDR command structure \ref cy_stc_i3c_hdr_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void ControllerHDRWrite(I3C_CORE_Type *base, cy_stc_i3c_hdr_cmd_t *hdrCmd, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_ccc_t cmd;
    uint32_t pos;
    cy_en_i3c_status_t retStatus = CY_I3C_CONTROLLER_NOT_READY;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

    /* Clear the interrupts */
    Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

    /* Reset the Tx FIFO */
    I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_TX_FIFO_RST_Msk;
    do
    {
        /* wait till the reset is completed */
        retStatus = I3C_Check_Timeout(&timeout);
    }
    while (retStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

    pos = GetI3CDevAddrPos(base, context->destDeviceAddr, context);

    /* Prepare the data for the transfer */
    ControllerHandleDataTransmit(base, context);

    cmd.cmdHigh = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                  _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, (context->controllerBufferSize));


    cmd.cmdLow = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Msk |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID, CY_I3C_CONTROLLER_HDR_WRITE_TID) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD, hdrCmd->code) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, CY_I3C_HDR_DDR) |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;

    context->controllerStatus |= CY_I3C_CONTROLLER_HDR_DDR_WR_XFER;
    context->state = CY_I3C_CONTROLLER_TX;

    Cy_I3C_SetInterruptMask(base, (CY_I3C_INTR_TRANSFER_ERR_STS | CY_I3C_INTR_RESP_READY_STS));
    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_TRANSFER_ERR_STS | CY_I3C_INTR_RESP_READY_STS));

    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;

