PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
}

/*******************************************************************************
*  Function Name: ControllerHDRRead
****************************************************************************//**
*
* Reads data from a device specified by HDR command structure
* \ref cy_stc_i3c_hdr_cmd_t.
*
* \param base
* The pointer to the I3C instance.
*
* \param hdrCmd
* The pointer to the I3C HDR command structure \ref cy_stc_i3c_hdr_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void ControllerHDRRead(I3C_CORE_Type *base, cy_stc_i3c_hdr_cmd_t *hdrCmd, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_ccc_t cmd;
    uint32_t pos;

    pos = GetI3CDevAddrPos(base, context->destDeviceAddr, context);

    cmd.cmdHigh = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                  _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, (context->controllerBufferSize));

    cmd.cmdLow = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Msk |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID, CY_I3C_CONTROLLER_HDR_READ_TID) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD, hdrCmd->code) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, CY_I3C_HDR_DDR) |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;

    context->controllerStatus |= CY_I3C_CONTROLLER_HDR_DDR_RD_XFER;
    context->state = CY_I3C_CONTROLLER_RX;

    Cy_I3C_SetInterruptMask(base, (CY_I3C_INTR_TRANSFER_ERR_STS | CY_I3C_INTR_RESP_READY_STS));
    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_TRANSFER_ERR_STS | CY_I3C_INTR_RESP_READY_STS));

    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;

}


/*******************************************************************************
*  Function Name: ControllerRespReadyStsHandle
****************************************************************************//**
*
* Handles the response queue ready status interrupt \ref group_i3c_macros_intr_macros
* for controller mode of operation.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void ControllerRespReadyStsHandle(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t respCmdPort;
    uint8_t tid;


    respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
    tid = (uint8_t)(_FLD2VAL(I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_TID, respCmdPort));


    /* Handling the receive response for Controller SDR WRITE transfer */
    /* --------------------SDR/HDR WRITE TRANSFER----------------*/
    if ((((uint8_t)CY_I3C_CONTROLLER_SDR_WRITE_TID) == tid) || (((uint8_t)CY_I3C_CONTROLLER_HDR_WRITE_TID) == tid))
    {
        ControllerHandleWriteInterrupt(base, respCmdPort, context);
    }

    /* Handling the receive response for Controller SDR READ transfer */
    /* --------------------SDR/HDR READ TRANSFER----------------*/

    else if ((((uint8_t)CY_I3C_CONTROLLER_SDR_READ_TID) == tid) || (((uint8_t)CY_I3C_CONTROLLER_HDR_READ_TID) == tid))
    {
        ControllerHandleReadInterrupt(base, respCmdPort, context);
    }

    else
    {
        /* Unknown TID
        Do Nothing */
    }
}


/*******************************************************************************
*  Function Name: ControllerHandleWriteInterrupt
****************************************************************************//**
*
* Handles the response queue ready status interrupt  \ref group_i3c_macros_intr_macros
* with HDR/SDR write TID \ref cy_en_i3c_tid_t in the response status.
*
* \param base
* The pointer to the I3C instance.
*
* \param respCmdPort
* The value read from the response queue port register.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void ControllerHandleWriteInterrupt(I3C_CORE_Type *base, uint32_t respCmdPort, cy_stc_i3c_context_t *context)
{
    /* Expected number of bytes were not transmitted, WRITE terminated early */
    context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);
    context->state = CY_I3C_IDLE;

    uint32_t dataLen;

    dataLen = (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk);

    if (NULL != context->cbEvents)
    {
        (dataLen == 0UL) ? context->cbEvents(CY_I3C_CONTROLLER_WR_CMPLT_EVENT)  : context->cbEvents(CY_I3C_CONTROLLER_WR_EARLY_TERMINATION_EVENT);
    }
    CY_UNUSED_PARAMETER(base); /* Suppress a compiler warning about unused variables */
}

/*******************************************************************************
*  Function Name: ControllerHandleReadInterrupt
****************************************************************************//**
*
* Handles the response queue ready status interrupt \ref group_i3c_macros_intr_macros
* with HDR/SDR read TID \ref cy_en_i3c_tid_t in the response status.
*
* \param base
* The pointer to the I3C instance.
*
* \param respCmdPort
* The value read from the response queue port register.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void ControllerHandleReadInterrupt(I3C_CORE_Type *base, uint32_t respCmdPort, cy_stc_i3c_context_t *context)
{
    if (0UL != (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk))
    {
        ControllerHandleDataReceive(base, context);
        context->state = CY_I3C_IDLE;
        context->controllerStatus &= (~CY_I3C_CONTROLLER_BUSY);

        if (NULL != context->cbEvents)
        {
            context->cbEvents(CY_I3C_CONTROLLER_RD_CMPLT_EVENT);
        }
    }
}

