PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: ControllerHandleIBIInterrupt
****************************************************************************//**
*
* Handles the IBI interrupts \ref group_i3c_macros_intr_macros.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note When Async Timing Mode 0 is enabled through SETXTIME, TIR payload will be in following format.
* Word0 : top 4 bytes of C_REF counter value
* Word1 : bottom 4 bytes of C_REF counter value
* Word2 : top 4 bytes of C_C2 counter value
* word3 : bottom 4 bytes of C_C2 counter value
* Word5 : first byte is MDB, next two bytes T_C1 and last byte is T_C2.
*
*******************************************************************************/
static void ControllerHandleIBIInterrupt(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    (void)base;
    (void)context;

    uint32_t ibiData;
    uint8_t ibiType, ibiStatus;
    cy_stc_i3c_ibi_t ibiCallback;

    ibiData = I3C_CORE_IBI_QUEUE_STATUS(base);

    ibiType = (uint8_t)(_FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_ID, ibiData));
    ibiStatus = (uint8_t)(_FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_RESP_STS, ibiData));

    /* Hot-join */
    if (false != (CY_I3C_IBI_TYPE_HOT_JOIN(ibiType)))
    {
        ibiCallback.event = CY_I3C_IBI_HOTJOIN;
        ibiCallback.targetAddress = 0U;
        ibiCallback.status = (uint32_t)((0U == ibiStatus) ? CY_I3C_CONTROLLER_HOTJOIN_IBI_ACK : CY_I3C_CONTROLLER_IBI_NACK);

        if (NULL != context->cbIbi)
        {
            context->cbIbi(&ibiCallback);
        }
    }

    /* Controllership request */
    else if (false != (CY_I3C_IBI_TYPE_CONTROLLERSHIP_REQUEST(ibiType)))
    {
        ibiCallback.event = CY_I3C_IBI_CONTROLLER_REQ;
        ibiCallback.targetAddress = (uint8_t)(_FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_ID, ibiData) >> 1U);
        ibiCallback.status = (uint32_t)((0U == ibiStatus) ? CY_I3C_CONTROLLER_MR_IBI_ACK : CY_I3C_CONTROLLER_IBI_NACK);

        if (NULL != context->cbIbi)
        {
            context->cbIbi(&ibiCallback);
        }
    }

    /* Target Interrupt Request */
    else if (false != (CY_I3C_IBI_TYPE_TIR_REQUEST(ibiType)))
    {
        ibiCallback.event = CY_I3C_IBI_SIR;
        ibiCallback.targetAddress = (uint8_t)(_FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_ID, ibiData) & 0x7FUL);
        ibiCallback.payloadSize = (uint8_t)_FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_DATA_LENGTH, ibiData);
        ibiCallback.status = (uint32_t)((0U == ibiStatus) ? CY_I3C_CONTROLLER_SIR_IBI_ACK : CY_I3C_CONTROLLER_IBI_NACK);

        if (NULL != context->cbIbi)
        {
            context->cbIbi(&ibiCallback);
        }
    }

    else
    {
        /* Do Nothing */
    }
}


/*******************************************************************************
*  Function Name: RearrangeAddrTable
****************************************************************************//**
*
* Rearranges the DAT and local list of devices /ref cy_stc_i3c_controller_devlist_t
* when a device detaches from the bus and thus maintaining continuous free
* locations on the top of the DAT and local list of devices.
*
* \param base
* The pointer to the I3C instance.
*
* \param devIndex
* The position of the device being detached.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void RearrangeAddrTable(I3C_CORE_Type *base, uint8_t devIndex,  cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_device_t i3cDeviceTop;
    cy_stc_i2c_device_t i2cDeviceTop;
    uint32_t topDevPos, value;

    /* Case where the device being detached is not the top device on the list */
    topDevPos = (context->i3cController.devCount) - 1UL;

    if (devIndex != topDevPos)
    {
        /*
            1. Check if the top device is an i2c device or i3c device
            2. Update the DAT and the local list
            3. Also check for the case if the device to be detached is the top most device? Then do not perform the exchange
        */
        if (context->devList[topDevPos].i2c)
        {
            /* Top device is an i2c device */

            /* Moving the top device to the detached device position */
            i2cDeviceTop = context->devList[topDevPos].i2cDevice;
            context->devList[devIndex].i2cDevice = i2cDeviceTop;
            context->devList[devIndex].i2c = true;

            /* Erase the top position entries and mark the position free */
            context->i3cController.freePos |= CY_I3C_BIT(topDevPos);

            value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, i2cDeviceTop.staticAddress) |
                    I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Msk;
        }

        else
        {
            /* Top Device is an i3c device */

            /* Moving the top device to the detached device position */
            i3cDeviceTop = context->devList[topDevPos].i3cDevice;
            context->devList[devIndex].i3cDevice = i3cDeviceTop;
            context->devList[devIndex].i2c = false;

            /* Erase the top position entries and mark the position free */
            context->i3cController.freePos |= CY_I3C_BIT(topDevPos);

            value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, i3cDeviceTop.dynamicAddress) |
                    _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, i3cDeviceTop.staticAddress);
        }

        Cy_I3C_WriteIntoDeviceAddressTable(base, (uint8_t)devIndex, value);
        Cy_I3C_WriteIntoDeviceAddressTable(base, (uint8_t)topDevPos, 0UL);
    }

    /* Case where the device getting detached is the top device on the list and thus no rearrangement is not required */
    else
    {
        Cy_I3C_WriteIntoDeviceAddressTable(base, devIndex, 0UL);
        context->i3cController.freePos |= CY_I3C_BIT(devIndex);
    }

