PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
}

/*******************************************************************************
*  Function Name: CCCTargetAddressValidation
****************************************************************************//**
*
* Validates whether the target address is an I3C device address on the bus/
* broadcast address.
*
* \param address
* The address to be validated.
*
* \param uincastOnly
* true: address is checked for I3C device address on the bus only.
* false: otherwise.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t CCCTargetAddressValidation(uint8_t address, bool unicastOnly, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_addr_slot_status_t res;

    res = GetAaddrslotStatus(address, context);

    if (unicastOnly)
    {
        if (CY_I3C_ADDR_SLOT_I3C_DEV != res)
        {
            return CY_I3C_BAD_PARAM;
        }

        context->controllerStatus |=  CY_I3C_CONTROLLER_DIRECTED_CCC_WR_XFER;

        return CY_I3C_SUCCESS;
    }

    else
    {
        /* This helps to check if the device is actively present on the bus */
        if ((CY_I3C_ADDR_SLOT_I3C_DEV != res) && (CY_I3C_ADDR_SLOT_RSVD != res))
        {
            return CY_I3C_BAD_PARAM;
        }

        if (CY_I3C_BROADCAST_ADDR == address)
        {
            context->controllerStatus |= CY_I3C_CONTROLLER_BROADCAST_CCC_WR_XFER;
        }

        else
        {
            context->controllerStatus |=  CY_I3C_CONTROLLER_DIRECTED_CCC_WR_XFER;
        }

        return CY_I3C_SUCCESS;
    }
}


/*******************************************************************************
*  Function Name: ControllerHandleCCCResponse
****************************************************************************//**
*
* Handles the response of CCCs sent.
*
* \param base
* The pointer to the I3C instance.
*
* \param resp
* The pointer to the response queue port register value.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t ControllerHandleCCCResponse(I3C_CORE_Type *base, uint32_t *resp, cy_stc_i3c_context_t *context)
{
    uint32_t respCmdPort;
    cy_en_i3c_status_t retStatus = CY_I3C_SUCCESS;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

    /* Handling the response */
    do
    {
        retStatus = I3C_Check_Timeout(&timeout);
        /* wait until the response ready interrupt is received */
    }
    while (retStatus == CY_I3C_SUCCESS && 0UL == ((CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS) & Cy_I3C_GetInterruptStatus(base)));

    if (retStatus == CY_I3C_TIMEOUT)
    {
        return retStatus;
    }

    respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
    Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

    if (0UL != (respCmdPort & I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
    {
        retStatus = ResponseError(respCmdPort);    /* unsuccessful due to transfer error */
        context->controllerStatus |= CY_I3C_CONTROLLER_HALT_STATE;
    }

    Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
    Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

    if (resp != NULL)
    {
        *resp = respCmdPort;
    }

    return retStatus;
}

/*******************************************************************************
*  Function Name: TargetRespReadyStsHandle
****************************************************************************//**
*
* Handles the response queue ready status interrupt \ref group_i3c_macros_intr_macros
* for target mode of operation.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
#if CY_IP_MXI3C_VERSION_MINOR == 1u || defined(CY_DOXYGEN)
static void TargetRespReadyStsHandle(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t respCmdPort;
    uint32_t event;
    uint8_t cccHeader;
    cy_en_i3c_status_t retStatus = CY_I3C_CONTROLLER_NOT_READY;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

    respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
    cccHeader = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_CCC_HDR_HEADER, respCmdPort);

    if (0UL != (respCmdPort & I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
    {
        uint32_t errorEvent;

        errorEvent = ResponseErrorEvent(respCmdPort);
        if (NULL != context->cbEvents)
        {
            context->cbEvents(errorEvent);
        }
        return;
    }

    if (CY_I3C_CCC_DEFTGTS == cccHeader)
    {
        context->deftgts_count = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH_LSB, respCmdPort);
        if (NULL != context->cbEvents)
        {
            context->cbEvents(CY_I3C_DEFTGT_EVENT);
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_DEFTGT_STS);
        return;
    }

    /* Handle the SDR Transfer*/
    if (0U == cccHeader)
    {
        if (0UL != (respCmdPort & I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_RX_RSP_Msk))
        {
            /* Receive Response - controller write */
            context->targetRxBufferCnt = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH, respCmdPort);
            if (context->targetRxBuffer == NULL)
            {
                if (NULL != (context->cbEvents))
                {
                    context->cbEvents(CY_I3C_TARGET_WR_BUFFER_NOT_CONFIGURED);
                }
                return;
            }
            TargetHandleDataReceive(base, context);

            I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_RX_FIFO_RST_Msk;
            do
            {
                /* wait till the reset is completed */
                retStatus = I3C_Check_Timeout(&timeout);
            }
            while (retStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

            context->targetStatus = CY_I3C_TARGET_RD_CMPLT;
            event = CY_I3C_TARGET_RD_CMPLT_EVENT;

            context->state = CY_I3C_IDLE;
            if (NULL != context->cbEvents)
            {
                context->cbEvents(event);
            }
        }
        else
        {
            /* Transmit Response - controller read */
            uint32_t size;

            /* Gets the number of entries in the Tx Fifo */
            size = (CY_I3C_FIFO_SIZE / 4UL) - Cy_I3C_GetFreeEntriesInTxFifo(base);

            context->targetTxBufferCnt = (context->targetTxBufferIdx) - size;
            context->targetStatus = CY_I3C_TARGET_WR_CMPLT;
            event = CY_I3C_TARGET_WR_CMPLT_EVENT;

            context->state = CY_I3C_IDLE;
            if (NULL != context->cbEvents)
            {
                context->cbEvents(event);
            }
        }
        return;
    }
    /* Handle the SETXTIME CCC*/
    else if (CY_I3C_CCC_SETXTIME(false) == cccHeader  || CY_I3C_CCC_SETXTIME(true) == cccHeader)
    {
        uint8_t subcmd;
        subcmd = (uint8_t)Cy_I3C_ReadRxFIFO(base);
        if (subcmd == CY_I3C_ENTER_ASYNC_MODE0)
        {
            context->ATM0Enabled = true;
            I3C->TIMING_CNT_CTRL |= I3C_TIMING_CNT_CTRL_CNT_ENABLE_Msk;
            I3C->TIMING_CNT_CTRL |= I3C_TIMING_CNT_CTRL_CNT_RESET_Msk;

