PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
        }
        else if (subcmd == CY_I3C_EXIT_ASYNC_MODES)
        {
            context->ATM0Enabled = false;
            I3C->TIMING_CNT_CTRL &= ~I3C_TIMING_CNT_CTRL_CNT_ENABLE_Msk;
        }
        return;
    }
    /* Handle the RSTACT CCC*/
    else if (CY_I3C_CCC_RSTACT(false) == cccHeader  || CY_I3C_CCC_RSTACT(true) == cccHeader)
    {
        uint8_t data;
        cy_stc_i3c_ccc_cmd_t cccCmd = {0};
        cy_stc_i3c_ccc_payload_t payload;
        cccCmd.cmd = CY_I3C_CCC_RSTACT(false);
        cccCmd.data = &payload;
        cccCmd.data->data = &(context->resetMode);
        cccCmd.data->len = 1U;
        if (I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_RX_RSP_Msk & respCmdPort)        /*rstact write command response*/
        {
            data  = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DEFINING_BYTE, respCmdPort);
            if (data > (uint8_t)CY_I3C_CHIP_RESET)
            {
                return;
            }

            context->resetMode = (cy_en_i3c_target_reset_t)data;

            /* reconfiguring vendor ccc for RSTACT*/
            cccCmd.data->data = &(context->resetMode);
            cccCmd.db = 0x00U;
            Cy_I3C_ConfigureVendorCCC(base, &cccCmd, 2U);
            cccCmd.db = 0x01U;
            Cy_I3C_ConfigureVendorCCC(base, &cccCmd, 3U);

        }
        else                                                                /*rstact read command response*/
        {
            /* reconfiguring vendor ccc for RSTACT*/
            if (0U == _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DEFINING_BYTE, respCmdPort))
            {
                cccCmd.db = 0x00U;
                Cy_I3C_ConfigureVendorCCC(base, &cccCmd, 2U);
            }
            else
            {
                cccCmd.db = 0x01U;
                Cy_I3C_ConfigureVendorCCC(base, &cccCmd, 3U);
            }
        }
        return;
    }
    /* Handle the DEVCTRL CCC*/
    else if (CY_I3C_CCC_DEVCTRL == cccHeader)
    {
        uint8_t data[6];
        uint8_t len = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH_LSB, respCmdPort);
        Cy_I3C_TargetGetcccData(base, (uint8_t*)&data, len, context);
        bool isPECEnabled = context->PECEnabled;
        uint8_t addr = 0;
        cy_en_i3c_devctrl_addrMsk_t addrMask = (cy_en_i3c_devctrl_addrMsk_t)(data[0] >> 5);
        (void)Cy_I3C_TargetGetDynamicAddress(base, &addr, context);

        /*Check if DEVCTRL is applicable for this target*/
        if (addrMask == BROADCAST_CMD)               /*broadcast condition*/
        {
            isPECEnabled = (bool)(data[2] & CY_I3C_BIT(7));
        }
        else if (addrMask == MULTICAST_CMD)             /*multicast condition*/
        {
            if (((data[1] >> 1 & CY_I3C_GENMASK(6U, 3U)) & addr) == (data[1] >> 1 & CY_I3C_GENMASK(6U, 3U)))
            {
                isPECEnabled = (bool)(data[2] & CY_I3C_BIT(7));
            }
        }
        else if (addrMask == UNICAST_CMD)             /*unicast condition*/
        {
            if ((data[1] >> 1) == addr)
            {
                isPECEnabled = (bool)(data[2] & CY_I3C_BIT(7));

            }
        }

        if (isPECEnabled)
        {
            context->PECEnabled = true;
            I3C_CORE_DEVICE_CTRL(base) |= I3C_CORE_DEVICE_CTRL_TARGET_PEC_EN_Msk;
        }
        else
        {
            context->PECEnabled = false;
            I3C_CORE_DEVICE_CTRL(base) &= ~I3C_CORE_DEVICE_CTRL_TARGET_PEC_EN_Msk;
        }
        return;
    }
    /* Handle the vendor CCC response*/
    else
    {
        cy_stc_i3c_target_ccc_resp_t cccData;
        cccData.cmd = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_CCC_HDR_HEADER, respCmdPort);
        cccData.db = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DEFINING_BYTE, respCmdPort);
        cccData.len = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH_LSB, respCmdPort);
        cccData.rxRsp = _FLD2VAL(I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_RX_RSP, respCmdPort);

        context->cccRespEvents(&cccData);
    }
}


/*******************************************************************************
* Function Name: TargetHandleDataReceive
****************************************************************************//**
*
* Reads data from RX FIFO into the buffer provided by
* \ref Cy_I3C_TargetConfigWriteBuf.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void TargetHandleDataReceive(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if (context->targetRxBufferSize > 0UL)
    {
        context->state = CY_I3C_TARGET_RX;
        context->targetStatus = CY_I3C_TARGET_RD_BUSY;
        uint32_t numToCopy;

        numToCopy = ((CY_I3C_FIFO_SIZE / 4UL) - Cy_I3C_GetFreeEntriesInRxFifo(base));

        ReadArray(base, context->targetRxBuffer, numToCopy * 4UL);
        context->targetRxBufferIdx += numToCopy;
        context->targetRxBufferSize -= numToCopy;

        context->targetRxBuffer = &(context->targetRxBuffer[context->targetRxBufferIdx]);
    }
}


/*******************************************************************************
* Function Name: TargetHandleDataTransmit
****************************************************************************//**
*
* Loads TX FIFO with data provided by \ref Cy_I3C_TargetConfigReadBuf.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void TargetHandleDataTransmit(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if (0UL != context->targetTxBufferSize)
    {
        context->state = CY_I3C_TARGET_TX;
        context->targetStatus = CY_I3C_TARGET_WR_BUSY;

        uint32_t numToCopy;

