PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
        numToCopy = Cy_I3C_GetFreeEntriesInTxFifo(base) * 4UL;

        if (numToCopy > (context->targetTxBufferSize))
        {
            numToCopy = context->targetTxBufferSize;
        }
        WriteArray(base, context->targetTxBuffer, numToCopy);
        context->targetTxBufferIdx += numToCopy;
        context->targetTxBufferSize -= numToCopy;
        context->targetTxBuffer = &context->targetTxBuffer[context->targetTxBufferIdx];
    }
    else
    {
        Cy_I3C_SetInterruptStatusMask(base, (~CY_I3C_INTR_TX_BUFFER_THLD_STS & Cy_I3C_GetInterruptStatusMask(base)));
        Cy_I3C_SetInterruptMask(base, (~CY_I3C_INTR_TX_BUFFER_THLD_STS & Cy_I3C_GetInterruptMask(base)));
    }
}
#endif

/******************************************************************************
* Function Name: I3C_Check_Timeout
****************************************************************************//**
*
* Waits for one micro second before unblock code execution.
* Note that if a timeout value is 0, this function does nothing and returns 0.
*
* \param timeout
* The pointer to a timeout value.
*
* \return
* Returns CY_I3C_SUCCESS if a timeout does not expire or the CY_I3C_TIMEOUT if time out is reached.
*
*******************************************************************************/
static cy_en_i3c_status_t I3C_Check_Timeout(uint32_t *timeout)
{
    cy_en_i3c_status_t status = CY_I3C_SUCCESS;

    /* If the timeout equal to 0. Ignore the timeout */
    if (*timeout > 0UL)
    {
        Cy_SysLib_DelayUs(1U);
        --(*timeout);

        if (0UL == *timeout)
        {
            status = CY_I3C_TIMEOUT;
        }
    }

    return (status);
}

/*******************************************************************************
* Function Name: Cy_I3C_SoftReset
****************************************************************************//**
*
* Soft reset for I3C. It resets all buffers: Transmit, Receive, command, Response.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* reset successful status - CY_I3C_TIMEOUT / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_SoftReset(I3C_CORE_Type const *base)
{
    cy_en_i3c_status_t retStatus = CY_I3C_SUCCESS;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;

    I3C_CORE_RESET_CTRL(base) |=  I3C_CORE_RESET_CTRL_SOFT_RST_Msk;
    do
    {
        /* wait till the reset is completed */
        retStatus = I3C_Check_Timeout(&timeout);
    }
    while (retStatus == CY_I3C_SUCCESS && I3C_CORE_RESET_CTRL(base) != 0U);

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_I3C_Reset
****************************************************************************//**
*
* Reset for I3C. It resets complete I3C peripheral while retaining assigned dynamic address in target mode.
*
* \param base
* The pointer to the I3C instance.
*
*
* \param config
* The pointer to the configuration structure \ref cy_stc_i3c_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* reset successful status - CY_I3C_TIMEOUT / CY_I3C_SUCCESS.
*
* \note
* After calling Cy_I3C_Reset, I3C target needs few SCL clock cycle to come out of reset state.
* This may cause first transaction after reset to be NACKed.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_Reset(I3C_CORE_Type *base, cy_stc_i3c_config_t const *config, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus = CY_I3C_SUCCESS;

    retStatus = Cy_I3C_SoftReset(base);
    if (retStatus != CY_I3C_SUCCESS)
    {
        return retStatus;
    }

#if CY_IP_MXI3C_VERSION_MINOR == 1u
    cy_en_i3c_status_t addressStatus = CY_I3C_SUCCESS;
    uint8_t addr = 0;
    if (CY_I3C_TARGET == context->i3cMode)
    {
        addressStatus = Cy_I3C_TargetGetDynamicAddress(base, &addr, context);
    }
#endif

    if (CY_I3C_CONTROLLER == context->i3cMode)
    {
        context->i3cController.devCount = 0UL;
    }
    /* Disabling the IP */
    I3C->CTRL &= ~I3C_CTRL_ENABLED_Msk;

    retStatus = Cy_I3C_Init(base, config, context);

#if CY_IP_MXI3C_VERSION_MINOR == 1u
    if (CY_I3C_TARGET == context->i3cMode && addressStatus == CY_I3C_SUCCESS && retStatus == CY_I3C_SUCCESS)
    {
        I3C_CORE_DEVICE_ADDR(base) |= _VAL2FLD(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, addr) |
                                      I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID_Msk;
    }
#endif

    Cy_I3C_Enable(base, context);

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_I3C_ControllerWriteDMA
****************************************************************************//**
*
* Initiate an I3C data transfer with DMA, Appropriate trig mux should be set before calling this API.
*
* \param base
* The pointer to the I3C instance.
*
* \param targetAddress
* Dynamic address of target to transfer data.
*
* \param Datalength
* Number of bytes of data to be transferred.max upto 65535 Bytes.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* reset successful status - CY_I3C_BAD_PARAM / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerWriteDMA(I3C_CORE_Type *base, uint8_t targetAddress, uint32_t Datalength, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_ccc_t cmd;
    uint8_t pos = 0U;
    cy_stc_i3c_controller_devlist_t *i3cDeviceList;
    uint8_t readDSMode = (uint8_t)CY_I3C_SDR0;
    cy_en_i3c_addr_slot_status_t res = GetAaddrslotStatus(targetAddress, context);

    /* This helps to check if the device is actively present on the bus */
    if (((CY_I3C_ADDR_SLOT_I3C_DEV != res) && (CY_I3C_ADDR_SLOT_I2C_DEV != res)) || (Datalength > MAX_I3C_DATA_LENGTH))
    {
        return CY_I3C_BAD_PARAM;

