PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    }

    if (CY_I3C_ADDR_SLOT_I2C_DEV == res)
    {
        /* The target device is an i2cDevice */
        pos = (uint8_t)(GetI2CDevAddrPos(base, targetAddress, context));
        i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
        readDSMode = (uint8_t)((0U != (i3cDeviceList->i2cDevice.lvr & CY_I3C_LVR_I2C_MODE_INDICATOR)) ? CY_I3C_FM_I2C : CY_I3C_FMP_I2C);
        context->controllerStatus |= CY_I3C_CONTROLLER_I2C_SDR_WR_XFER;
    }
    else
    {
        /* The target is an i3cDevice */
        pos = (uint8_t)(GetI3CDevAddrPos(base, targetAddress, context));
        i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
        if (i3cDeviceList->i3cDevice.speedLimit == true)
        {
            readDSMode = (i3cDeviceList->i3cDevice.maxWriteDs) & 0x07U;
        }
        context->controllerStatus |= CY_I3C_CONTROLLER_I3C_SDR_WR_XFER;
    }
    cmd.cmdLow = I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk | I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID, CY_I3C_CONTROLLER_SDR_WRITE_TID) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, readDSMode) |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk;

    cmd.cmdHigh = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                  _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, Datalength);

    if (context->devList[pos].i3cDevice.PECEnabled)
    {
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk;
    }

    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;
    return CY_I3C_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_I3C_ControllerReadDMA
****************************************************************************//**
*
* Initiate an I3C data Receive with DMA, Appropriate trig mux should be set before calling this API
*
* \param base
* The pointer to the I3C instance.
*
* \param targetAddress
* Dynamic address of target to transfer data.
*
* \param Datalength
* Number of bytes of data to be transferred.max upto 65535 Bytes.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* reset successful status - CY_I3C_BAD_PARAM / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ControllerReadDMA(I3C_CORE_Type *base, uint8_t targetAddress, uint32_t Datalength, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_ccc_t cmd;
    uint8_t pos = 0U;
    cy_stc_i3c_controller_devlist_t *i3cDeviceList;
    uint8_t readDSMode = (uint8_t)CY_I3C_SDR0;
    cy_en_i3c_addr_slot_status_t res = GetAaddrslotStatus(targetAddress, context);

    /* This helps to check if the device is actively present on the bus */
    if (((CY_I3C_ADDR_SLOT_I3C_DEV != res) && (CY_I3C_ADDR_SLOT_I2C_DEV != res)) || (Datalength > MAX_I3C_DATA_LENGTH))
    {
        return CY_I3C_BAD_PARAM;

    }

    if (CY_I3C_ADDR_SLOT_I2C_DEV == res)
    {
        /* The target device is an i2cDevice */
        pos = (uint8_t)(GetI2CDevAddrPos(base, targetAddress, context));
        i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
        readDSMode = (uint8_t)((0U != (i3cDeviceList->i2cDevice.lvr & CY_I3C_LVR_I2C_MODE_INDICATOR)) ? CY_I3C_FM_I2C : CY_I3C_FMP_I2C);
        context->controllerStatus |= CY_I3C_CONTROLLER_I2C_SDR_RD_XFER;
    }
    else
    {
        /* The target is an i3cDevice */
        pos = (uint8_t)(GetI3CDevAddrPos(base, targetAddress, context));
        i3cDeviceList = &(context->devList[pos]); /* pointing to the device position in the local list of devices on the bus */
        if (i3cDeviceList->i3cDevice.speedLimit == true)
        {
            readDSMode = (i3cDeviceList->i3cDevice.maxReadDs) & 0x07U;
        }
        context->controllerStatus |= CY_I3C_CONTROLLER_I3C_SDR_RD_XFER;
    }

    cmd.cmdHigh = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                  _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, Datalength);

    cmd.cmdLow = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID, CY_I3C_CONTROLLER_SDR_READ_TID) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, readDSMode) |
                 _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk |
                 I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;
    if (context->devList[pos].i3cDevice.PECEnabled)
    {
        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk;
    }

    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
    I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;
    return CY_I3C_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_I3C_GetIbiPayload
****************************************************************************//**
*
* Read data received with IBI into given buffer.
* This function must be called from IBI callback handler.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to the buffer tp store data read from IBI.
*
* \param size
* Number of bytes of data received.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* reset successful status - CY_I3C_BAD_PARAM / CY_I3C_SUCCESS.
*
*******************************************************************************/
#if CY_IP_MXI3C_VERSION_MINOR == 1u || defined(CY_DOXYGEN)
cy_en_i3c_status_t Cy_I3C_GetIbiPayload(I3C_CORE_Type *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context)
{
    uint32_t index, buffer_index = 0UL;
    uint32_t value = 0UL;
    uint32_t wd_size = 0UL, byte_size = 0UL;

