PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    if (((uintptr_t)buffer % (uintptr_t)4U) == 0UL)      /*checking for 4 byte alignment*/
    {
        wd_size = size / 4U;
        byte_size = size % 4U;
    }
    else
    {
        byte_size = size;
    }

    for (index = 0UL; index < wd_size; index++)
    {
        value = I3C_CORE_IBI_QUEUE_DATA(base);
        *((uint32_t *)buffer + buffer_index++) = value;
    }
    buffer_index *= 4UL;
    for (index = 0UL; index < byte_size; index++)
    {
        if (index % 4UL == 0UL)
        {
            value = I3C_CORE_IBI_QUEUE_DATA(base);
        }
        *((uint8_t *)buffer + buffer_index++) = (uint8_t)(value & 0xFFUL);
        value = value >> 8UL;
    }
    CY_UNUSED_PARAMETER(context);

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
* Function Name: EnableIbiPayload
****************************************************************************//**
*
* Enable IBI with payload functionality. To read IBI data sent from target.
*
* \param base
* The pointer to the I3C instance.
*
* \param targetAddress
* Dynamic address of target device, to enable ibi payload.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* reset successful status - CY_I3C_BAD_PARAM / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t EnableIbiPayload(I3C_CORE_Type *base, uint8_t targetAddress, cy_stc_i3c_context_t *context)
{
    uint32_t value;
    uint8_t pos;
    cy_en_i3c_addr_slot_status_t res = GetAaddrslotStatus(targetAddress, context);

    /* This helps to check if the device is actively present on the bus */
    if ((CY_I3C_ADDR_SLOT_I3C_DEV != res))
    {
        return CY_I3C_BAD_PARAM;
    }

    pos = GetI3CDevAddrPos(base, targetAddress, context);

    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
    value |= I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_WITH_DATA_Msk;

    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
* Function Name: DisableIbiPayload
****************************************************************************//**
*
* Disable IBI with payload functionality. Ack the IBI but do not read IBI data sent from target.
*
* \param base
* The pointer to the I3C instance.
*
* \param targetAddress
* Dynamic address of target device, to disable ibi payload.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* reset successful status - CY_I3C_BAD_PARAM / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t DisableIbiPayload(I3C_CORE_Type *base, uint8_t targetAddress, cy_stc_i3c_context_t *context)
{
    uint32_t value;
    uint8_t pos;

    cy_en_i3c_addr_slot_status_t res = GetAaddrslotStatus(targetAddress, context);

    /* This helps to check if the device is actively present on the bus */
    if ((CY_I3C_ADDR_SLOT_I3C_DEV != res))
    {
        return CY_I3C_BAD_PARAM;
    }

    pos = GetI3CDevAddrPos(base, targetAddress, context);

    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);
    value &= ~I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_WITH_DATA_Msk;

    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
* Function Name: CY_I3C_isIbiPayloadEnabled
****************************************************************************//**
*
* Returns IBI payload enabled status. This indicates whether the IBI payload will be received from target.
* For invalid target address false will be returned.
*
* \param base
* The pointer to the I3C instance.
*
*
* \param targetAddress
* Dynamic address of target device, to disable ibi payload.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* whether the ibi with payload is enabled or not.
*
*******************************************************************************/
bool CY_I3C_isIbiPayloadEnabled(I3C_CORE_Type *base, uint8_t targetAddress, cy_stc_i3c_context_t *context)
{
    uint32_t value;
    uint8_t pos;
    bool isEnabled;

    cy_en_i3c_addr_slot_status_t res = GetAaddrslotStatus(targetAddress, context);
    /* This helps to check if the I3C device is actively present on the bus */
    if ((CY_I3C_ADDR_SLOT_I3C_DEV != res))
    {
        return false;
    }

    pos = GetI3CDevAddrPos(base, targetAddress, context);

    value = Cy_I3C_ReadFromDeviceAddressTable(base, pos);

    isEnabled = (bool)_FLD2VAL(I3C_CORE_DEV_ADDR_TABLE_LOC1_IBI_WITH_DATA, value);

    return (isEnabled);
}
#endif

/*******************************************************************************
* Function Name: Cy_I3C_ConfigureVendorCCC
****************************************************************************//**
*
* Configure vendor specific CCC. Target will ACK this CCC in read mode and transfer the configured data.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the CCC command description structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param num
* number of vendor specific ccc to be be configured.
*
* \return
* configuration status - CY_I3C_TIMEOUT / CY_I3C_SUCCESS.
*
*******************************************************************************/
#if CY_IP_MXI3C_VERSION_MINOR == 1u || defined(CY_DOXYGEN)
static cy_en_i3c_status_t Cy_I3C_ConfigureVendorCCC(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t* cccCmd, uint8_t num)
{
    cy_en_i3c_status_t retStatus = CY_I3C_SUCCESS;
    uint32_t index = 0UL;
    uint32_t *data = cccCmd->data->data;
    uint32_t timeout = MAX_I3C_TRANSACTION_TIMEOUT;
    uint32_t *DATA_PORT = (uint32_t *)&base->EXT_TX_DATA_PORT_0 + num;
    uint32_t *CMD_REG = (uint32_t *)&base->EXT_CMD_REG_0 + num;

    base->EXT_TX_QUEUE_RESET_CTRL = (I3C_CORE_EXT_TX_QUEUE_RESET_CTRL_EXT_TX_FIFO_RST_0_Msk << num);
    do
    {
        /* wait till the reset is completed */
        retStatus = I3C_Check_Timeout(&timeout);
    }
    while (retStatus == CY_I3C_SUCCESS && base->EXT_TX_QUEUE_RESET_CTRL != 0U);

    if (cccCmd->data->len > 8U)            /*checking for max data buffer size*/
    {
        return CY_I3C_BAD_BUFFER_SIZE;
    }

    /*Write into TX_FIFO for Vendor specific CCCs*/
    for (index = 0UL; index < (cccCmd->data->len / 4UL); ++index)
    {
        *DATA_PORT = _VAL2FLD(I3C_CORE_EXT_TX_DATA_PORT_0_EXT_TX_DATA_PORT_0, *(data + index));
    }
    if (0UL != (cccCmd->data->len & 3UL)) /*write remaining bytes in Tx_Fifo */
    {
        uint8_t cnt = (uint8_t)(cccCmd->data->len & 3UL);
        uint8_t *srcPtr, *destPtr;
        uint32_t value = 0UL;
        destPtr = (uint8_t *)(&value);
        srcPtr = (uint8_t *)(data + index);

        for (index = 0UL; index < cnt; index++)
        {
            *destPtr = *srcPtr;
            destPtr++;
            srcPtr++;
        }
        *DATA_PORT = _VAL2FLD(I3C_CORE_EXT_TX_DATA_PORT_0_EXT_TX_DATA_PORT_0, value);
    }

    /*Configure Vendor specific CCCs*/
    *CMD_REG = I3C_CORE_EXT_CMD_REG_0_TID_Msk | _VAL2FLD(I3C_CORE_EXT_CMD_REG_0_DL_LSB, cccCmd->data->len & 0x3U) | _VAL2FLD(I3C_CORE_EXT_CMD_REG_0_DEFINING_BYTE, cccCmd->db) | _VAL2FLD(I3C_CORE_EXT_CMD_REG_0_CCC_TYPE, cccCmd->cmd);

