PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_i3c.c
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_I3C_ConfigureVendorCCC0
****************************************************************************//**
*
* Configure vendor specific CCC0. Target will ACK this CCC in read mode and transfer the configured data.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the CCC command description structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* configuration status - CY_I3C_TIMEOUT / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ConfigureVendorCCC0(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t* cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus = Cy_I3C_ConfigureVendorCCC(base, cccCmd, 0U);

    CY_UNUSED_PARAMETER(context); /* Suppress a compiler warning about unused variables */
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_I3C_ConfigureVendorCCC1
****************************************************************************//**
*
* Configure vendor specific CCC1. Target will ACK this CCC in read mode and transfer the configured data.
*
* \param base
* The pointer to the I3C instance.
*
* \param cccCmd
* The pointer to the CCC command description structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* configuration status - CY_I3C_TIMEOUT / CY_I3C_SUCCESS.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_ConfigureVendorCCC1(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t* cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus = Cy_I3C_ConfigureVendorCCC(base, cccCmd, 1U);

    CY_UNUSED_PARAMETER(context); /* Suppress a compiler warning about unused variables */
    return retStatus;
}
#endif
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 14.3')

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXI3C */
/* [] END OF FILE */
